NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
/* ==========================  Configuration of the ARM Cortex-M33 Processor and Core Peripherals  =========================== */
#define __CM33_REV                 0x0004U      /*!< CM33 Core Revision                                                        */
#define __INTERRUPTS_MAX                   240        /*!< Top interrupt number                                                      */
#define __DSP_PRESENT                  1        /*!< DSP present or not                                                        */
#define __NVIC_PRIO_BITS               3        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */
#define __FPU_DP                       0        /*!< Double Precision FPU                                                      */
#define __SAUREGION_PRESENT            0        /*!< SAU region present                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm33.h"                          /*!< ARM Cortex-M33 processor and core peripherals                             */
#include "system_nrf9120.h"                     /*!< nrf9120 System                                                            */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                              Device Specific Cluster Section                              ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_clusters
  * @{
  */


/**
  * @brief FICR_INFO [INFO] (Device info)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  DEVICEID[2];                  /*!< Description collection: Device identifier                                 */
  __IM  uint32_t  PART;                         /*!< Part code                                                                 */
  __IM  uint32_t  VARIANT;                      /*!< Part Variant, Hardware version and Production configuration               */
  __IM  uint32_t  PACKAGE;                      /*!< Package option                                                            */
  __IM  uint32_t  RAM;                          /*!< RAM variant                                                               */
  __IM  uint32_t  FLASH;                        /*!< Flash variant                                                             */
  __IM  uint32_t  CODEPAGESIZE;                 /*!< Code memory page size                                                     */
  __IM  uint32_t  CODESIZE;                     /*!< Code memory size                                                          */
  __IM  uint32_t  DEVICETYPE;                   /*!< Device type                                                               */
} FICR_INFO_Type;                               /*!< Size = 44 (0x2c)                                                          */


/**
  * @brief FICR_TRIMCNF [TRIMCNF] (Unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDR;                         /*!< Description cluster: Address                                              */
  __IM  uint32_t  DATA;                         /*!< Description cluster: Data                                                 */
} FICR_TRIMCNF_Type;                            /*!< Size = 8 (0x8)                                                            */


/**
  * @brief FICR_TRNG90B [TRNG90B] (NIST800-90B RNG calibration data)
  */
typedef struct {
  __IM  uint32_t  BYTES;                        /*!< Amount of bytes for the required entropy bits                             */
  __IM  uint32_t  RCCUTOFF;                     /*!< Repetition counter cutoff                                                 */
  __IM  uint32_t  APCUTOFF;                     /*!< Adaptive proportion cutoff                                                */
  __IM  uint32_t  STARTUP;                      /*!< Amount of bytes for the startup tests                                     */
  __IM  uint32_t  ROSC1;                        /*!< Sample count for ring oscillator configuration 1                          */
  __IM  uint32_t  ROSC2;                        /*!< Sample count for ring oscillator configuration 2                          */
  __IM  uint32_t  ROSC3;                        /*!< Sample count for ring oscillator configuration 3                          */
  __IM  uint32_t  ROSC4;                        /*!< Sample count for ring oscillator configuration 4                          */
} FICR_TRNG90B_Type;                            /*!< Size = 32 (0x20)                                                          */


/**
  * @brief UICR_KEYSLOT_CONFIG [CONFIG] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  DEST;                         /*!< Description cluster: Destination address where content of the
                                                     key value registers (KEYSLOT.KEYn.VALUE[0-3]) will be pushed
                                                     by KMU. Note that this address must match that of a peripheral's
                                                     APB mapped write-only key registers, otherwise the KMU
                                                     can push this key value into an address range which the
                                                     CPU can potentially read.                                                 */
  __IOM uint32_t  PERM;                         /*!< Description cluster: Define permissions for the key slot. Bits
                                                     0-15 and 16-31 can only be written when equal to 0xFFFF.                  */
} UICR_KEYSLOT_CONFIG_Type;                     /*!< Size = 8 (0x8)                                                            */


/**
  * @brief UICR_KEYSLOT_KEY [KEY] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[4];                     /*!< Description collection: Define bits [31+o*32:0+o*32] of value
                                                     assigned to KMU key slot.                                                 */
} UICR_KEYSLOT_KEY_Type;                        /*!< Size = 16 (0x10)                                                          */


/**
  * @brief UICR_KEYSLOT [KEYSLOT] (Unspecified)
  */
typedef struct {
  __IOM UICR_KEYSLOT_CONFIG_Type CONFIG[128];   /*!< Unspecified                                                               */
  __IOM UICR_KEYSLOT_KEY_Type KEY[128];         /*!< Unspecified                                                               */
} UICR_KEYSLOT_Type;                            /*!< Size = 3072 (0xc00)                                                       */


/**
  * @brief TAD_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  TRACECLK;                     /*!< Pin configuration for TRACECLK                                            */
  __IOM uint32_t  TRACEDATA0;                   /*!< Pin configuration for TRACEDATA[0]                                        */
  __IOM uint32_t  TRACEDATA1;                   /*!< Pin configuration for TRACEDATA[1]                                        */
  __IOM uint32_t  TRACEDATA2;                   /*!< Pin configuration for TRACEDATA[2]                                        */
  __IOM uint32_t  TRACEDATA3;                   /*!< Pin configuration for TRACEDATA[3]                                        */
} TAD_PSEL_Type;                                /*!< Size = 20 (0x14)                                                          */


/**
  * @brief SPU_EXTDOMAIN [EXTDOMAIN] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                         /*!< Description cluster: Access for bus access generated from the
                                                     external domain n List capabilities of the external domain
                                                     n                                                                         */
} SPU_EXTDOMAIN_Type;                           /*!< Size = 4 (0x4)                                                            */


/**
  * @brief SPU_DPPI [DPPI] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                         /*!< Description cluster: Select between secure and non-secure attribute
                                                     for the DPPI channels.                                                    */
  __IOM uint32_t  LOCK;                         /*!< Description cluster: Prevent further modification of the corresponding
                                                     PERM register                                                             */
} SPU_DPPI_Type;                                /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SPU_GPIOPORT [GPIOPORT] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                         /*!< Description cluster: Select between secure and non-secure attribute
                                                     for pins 0 to 31 of port n.                                               */
  __IOM uint32_t  LOCK;                         /*!< Description cluster: Prevent further modification of the corresponding
                                                     PERM register                                                             */
} SPU_GPIOPORT_Type;                            /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SPU_FLASHNSC [FLASHNSC] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  REGION;                       /*!< Description cluster: Define which flash region can contain the
                                                     non-secure callable (NSC) region n                                        */
  __IOM uint32_t  SIZE;                         /*!< Description cluster: Define the size of the non-secure callable
                                                     (NSC) region n                                                            */
} SPU_FLASHNSC_Type;                            /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SPU_RAMNSC [RAMNSC] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  REGION;                       /*!< Description cluster: Define which RAM region can contain the
                                                     non-secure callable (NSC) region n                                        */
  __IOM uint32_t  SIZE;                         /*!< Description cluster: Define the size of the non-secure callable
                                                     (NSC) region n                                                            */
} SPU_RAMNSC_Type;                              /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SPU_FLASHREGION [FLASHREGION] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                         /*!< Description cluster: Access permissions for flash region n                */
} SPU_FLASHREGION_Type;                         /*!< Size = 4 (0x4)                                                            */


/**
  * @brief SPU_RAMREGION [RAMREGION] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                         /*!< Description cluster: Access permissions for RAM region n                  */
} SPU_RAMREGION_Type;                           /*!< Size = 4 (0x4)                                                            */


/**
  * @brief SPU_PERIPHID [PERIPHID] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                         /*!< Description cluster: List capabilities and access permissions
                                                     for the peripheral with ID n                                              */
} SPU_PERIPHID_Type;                            /*!< Size = 4 (0x4)                                                            */


/**
  * @brief POWER_LTEMODEM [LTEMODEM] (LTE Modem)
  */
typedef struct {
  __IOM uint32_t  STARTN;                       /*!< Start LTE modem                                                           */
  __IOM uint32_t  FORCEOFF;                     /*!< Force off LTE modem                                                       */
} POWER_LTEMODEM_Type;                          /*!< Size = 8 (0x8)                                                            */


/**
  * @brief CTRLAPPERI_MAILBOX [MAILBOX] (Unspecified)
  */
typedef struct {
  __IM  uint32_t  RXDATA;                       /*!< Data sent from the debugger to the CPU.                                   */
  __IM  uint32_t  RXSTATUS;                     /*!< This register shows a status that indicates if data sent from
                                                     the debugger to the CPU has been read.                                    */
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  TXDATA;                       /*!< Data sent from the CPU to the debugger.                                   */
  __IM  uint32_t  TXSTATUS;                     /*!< This register shows a status that indicates if the data sent
                                                     from the CPU to the debugger has been read.                               */
} CTRLAPPERI_MAILBOX_Type;                      /*!< Size = 136 (0x88)                                                         */


/**
  * @brief CTRLAPPERI_ERASEPROTECT [ERASEPROTECT] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  LOCK;                         /*!< This register locks the ERASEPROTECT.DISABLE register from being
                                                     written until next reset.                                                 */
  __IOM uint32_t  DISABLE;                      /*!< This register disables the ERASEPROTECT register and performs
                                                     an ERASEALL operation.                                                    */
} CTRLAPPERI_ERASEPROTECT_Type;                 /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SPIM_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  SCK;                          /*!< Pin select for SCK                                                        */
  __IOM uint32_t  MOSI;                         /*!< Pin select for MOSI signal                                                */
  __IOM uint32_t  MISO;                         /*!< Pin select for MISO signal                                                */
} SPIM_PSEL_Type;                               /*!< Size = 12 (0xc)                                                           */


/**
  * @brief SPIM_RXD [RXD] (RXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in receive buffer                                 */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last transaction                       */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} SPIM_RXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief SPIM_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in transmit buffer                                */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last transaction                       */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} SPIM_TXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief SPIS_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  SCK;                          /*!< Pin select for SCK                                                        */
  __IOM uint32_t  MISO;                         /*!< Pin select for MISO signal                                                */
  __IOM uint32_t  MOSI;                         /*!< Pin select for MOSI signal                                                */
  __IOM uint32_t  CSN;                          /*!< Pin select for CSN signal                                                 */
} SPIS_PSEL_Type;                               /*!< Size = 16 (0x10)                                                          */


/**
  * @brief SPIS_RXD [RXD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< RXD data pointer                                                          */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in receive buffer                                 */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes received in last granted transaction                      */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} SPIS_RXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief SPIS_TXD [TXD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< TXD data pointer                                                          */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in transmit buffer                                */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transmitted in last granted transaction                   */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} SPIS_TXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief TWIM_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;                          /*!< Pin select for SCL signal                                                 */
  __IOM uint32_t  SDA;                          /*!< Pin select for SDA signal                                                 */
} TWIM_PSEL_Type;                               /*!< Size = 8 (0x8)                                                            */


/**
  * @brief TWIM_RXD [RXD] (RXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in receive buffer                                 */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last transaction                       */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} TWIM_RXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief TWIM_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in transmit buffer                                */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last transaction                       */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} TWIM_TXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief TWIS_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;                          /*!< Pin select for SCL signal                                                 */
  __IOM uint32_t  SDA;                          /*!< Pin select for SDA signal                                                 */
} TWIS_PSEL_Type;                               /*!< Size = 8 (0x8)                                                            */


/**
  * @brief TWIS_RXD [RXD] (RXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< RXD Data pointer                                                          */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in RXD buffer                                     */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last RXD transaction                   */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} TWIS_RXD_Type;                                /*!< Size = 16 (0x10)                                                          */


