NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
/**
  * @brief TWIS_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< TXD Data pointer                                                          */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in TXD buffer                                     */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last TXD transaction                   */
  __IOM uint32_t  LIST;                         /*!< EasyDMA list type                                                         */
} TWIS_TXD_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief UARTE_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  RTS;                          /*!< Pin select for RTS signal                                                 */
  __IOM uint32_t  TXD;                          /*!< Pin select for TXD signal                                                 */
  __IOM uint32_t  CTS;                          /*!< Pin select for CTS signal                                                 */
  __IOM uint32_t  RXD;                          /*!< Pin select for RXD signal                                                 */
} UARTE_PSEL_Type;                              /*!< Size = 16 (0x10)                                                          */


/**
  * @brief UARTE_RXD [RXD] (RXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in receive buffer                                 */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last transaction                       */
} UARTE_RXD_Type;                               /*!< Size = 12 (0xc)                                                           */


/**
  * @brief UARTE_TXD [TXD] (TXD EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of bytes in transmit buffer                                */
  __IM  uint32_t  AMOUNT;                       /*!< Number of bytes transferred in the last transaction                       */
} UARTE_TXD_Type;                               /*!< Size = 12 (0xc)                                                           */


/**
  * @brief SAADC_EVENTS_CH [EVENTS_CH] (Peripheral events.)
  */
typedef struct {
  __IOM uint32_t  LIMITH;                       /*!< Description cluster: Last results is equal or above CH[n].LIMIT.HIGH      */
  __IOM uint32_t  LIMITL;                       /*!< Description cluster: Last results is equal or below CH[n].LIMIT.LOW       */
} SAADC_EVENTS_CH_Type;                         /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SAADC_PUBLISH_CH [PUBLISH_CH] (Publish configuration for events)
  */
typedef struct {
  __IOM uint32_t  LIMITH;                       /*!< Description cluster: Publish configuration for event CH[n].LIMITH         */
  __IOM uint32_t  LIMITL;                       /*!< Description cluster: Publish configuration for event CH[n].LIMITL         */
} SAADC_PUBLISH_CH_Type;                        /*!< Size = 8 (0x8)                                                            */


/**
  * @brief SAADC_CH [CH] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PSELP;                        /*!< Description cluster: Input positive pin selection for CH[n]               */
  __IOM uint32_t  PSELN;                        /*!< Description cluster: Input negative pin selection for CH[n]               */
  __IOM uint32_t  CONFIG;                       /*!< Description cluster: Input configuration for CH[n]                        */
  __IOM uint32_t  LIMIT;                        /*!< Description cluster: High/low limits for event monitoring a
                                                     channel                                                                   */
} SAADC_CH_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief SAADC_RESULT [RESULT] (RESULT EasyDMA channel)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Data pointer                                                              */
  __IOM uint32_t  MAXCNT;                       /*!< Maximum number of buffer words to transfer                                */
  __IM  uint32_t  AMOUNT;                       /*!< Number of buffer words transferred since last START                       */
} SAADC_RESULT_Type;                            /*!< Size = 12 (0xc)                                                           */


/**
  * @brief DPPIC_TASKS_CHG [TASKS_CHG] (Channel group tasks)
  */
typedef struct {
  __OM  uint32_t  EN;                           /*!< Description cluster: Enable channel group n                               */
  __OM  uint32_t  DIS;                          /*!< Description cluster: Disable channel group n                              */
} DPPIC_TASKS_CHG_Type;                         /*!< Size = 8 (0x8)                                                            */


/**
  * @brief DPPIC_SUBSCRIBE_CHG [SUBSCRIBE_CHG] (Subscribe configuration for tasks)
  */
typedef struct {
  __IOM uint32_t  EN;                           /*!< Description cluster: Subscribe configuration for task CHG[n].EN           */
  __IOM uint32_t  DIS;                          /*!< Description cluster: Subscribe configuration for task CHG[n].DIS          */
} DPPIC_SUBSCRIBE_CHG_Type;                     /*!< Size = 8 (0x8)                                                            */


/**
  * @brief PWM_SEQ [SEQ] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Description cluster: Beginning address in RAM of this sequence            */
  __IOM uint32_t  CNT;                          /*!< Description cluster: Number of values (duty cycles) in this
                                                     sequence                                                                  */
  __IOM uint32_t  REFRESH;                      /*!< Description cluster: Number of additional PWM periods between
                                                     samples loaded into compare register                                      */
  __IOM uint32_t  ENDDELAY;                     /*!< Description cluster: Time added after the sequence                        */
  __IM  uint32_t  RESERVED[4];
} PWM_SEQ_Type;                                 /*!< Size = 32 (0x20)                                                          */


/**
  * @brief PWM_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  OUT[4];                       /*!< Description collection: Output pin select for PWM channel n               */
} PWM_PSEL_Type;                                /*!< Size = 16 (0x10)                                                          */


/**
  * @brief PDM_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  CLK;                          /*!< Pin number configuration for PDM CLK signal                               */
  __IOM uint32_t  DIN;                          /*!< Pin number configuration for PDM DIN signal                               */
} PDM_PSEL_Type;                                /*!< Size = 8 (0x8)                                                            */


/**
  * @brief PDM_SAMPLE [SAMPLE] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< RAM address pointer to write samples to with EasyDMA                      */
  __IOM uint32_t  MAXCNT;                       /*!< Number of samples to allocate memory for in EasyDMA mode                  */
} PDM_SAMPLE_Type;                              /*!< Size = 8 (0x8)                                                            */


/**
  * @brief I2S_CONFIG [CONFIG] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                         /*!< I2S mode.                                                                 */
  __IOM uint32_t  RXEN;                         /*!< Reception (RX) enable.                                                    */
  __IOM uint32_t  TXEN;                         /*!< Transmission (TX) enable.                                                 */
  __IOM uint32_t  MCKEN;                        /*!< Master clock generator enable.                                            */
  __IOM uint32_t  MCKFREQ;                      /*!< Master clock generator frequency.                                         */
  __IOM uint32_t  RATIO;                        /*!< MCK / LRCK ratio.                                                         */
  __IOM uint32_t  SWIDTH;                       /*!< Sample width.                                                             */
  __IOM uint32_t  ALIGN;                        /*!< Alignment of sample within a frame.                                       */
  __IOM uint32_t  FORMAT;                       /*!< Frame format.                                                             */
  __IOM uint32_t  CHANNELS;                     /*!< Enable channels.                                                          */
} I2S_CONFIG_Type;                              /*!< Size = 40 (0x28)                                                          */


/**
  * @brief I2S_RXD [RXD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Receive buffer RAM start address.                                         */
} I2S_RXD_Type;                                 /*!< Size = 4 (0x4)                                                            */


/**
  * @brief I2S_TXD [TXD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                          /*!< Transmit buffer RAM start address.                                        */
} I2S_TXD_Type;                                 /*!< Size = 4 (0x4)                                                            */


/**
  * @brief I2S_RXTXD [RXTXD] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  MAXCNT;                       /*!< Size of RXD and TXD buffers.                                              */
} I2S_RXTXD_Type;                               /*!< Size = 4 (0x4)                                                            */


/**
  * @brief I2S_PSEL [PSEL] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  MCK;                          /*!< Pin select for MCK signal.                                                */
  __IOM uint32_t  SCK;                          /*!< Pin select for SCK signal.                                                */
  __IOM uint32_t  LRCK;                         /*!< Pin select for LRCK signal.                                               */
  __IOM uint32_t  SDIN;                         /*!< Pin select for SDIN signal.                                               */
  __IOM uint32_t  SDOUT;                        /*!< Pin select for SDOUT signal.                                              */
} I2S_PSEL_Type;                                /*!< Size = 20 (0x14)                                                          */


/**
  * @brief APPROTECT_SECUREAPPROTECT [SECUREAPPROTECT] (Unspecified)
  */
typedef struct {
  union {
    __IOM uint32_t DISABLE;                     /*!< Software disable SECUREAPPROTECT mechanism                                */
    __IOM uint32_t FORCEPROTECT;                /*!< Software force SECUREAPPROTECT mechanism                                  */
  };
} APPROTECT_SECUREAPPROTECT_Type;               /*!< Size = 4 (0x4)                                                            */


/**
  * @brief APPROTECT_APPROTECT [APPROTECT] (Unspecified)
  */
typedef struct {
  union {
    __IOM uint32_t DISABLE;                     /*!< Software disable APPROTECT mechanism                                      */
    __IOM uint32_t FORCEPROTECT;                /*!< Software force APPROTECT mechanism                                        */
  };
} APPROTECT_APPROTECT_Type;                     /*!< Size = 4 (0x4)                                                            */


/**
  * @brief VMC_RAM [RAM] (Unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER;                        /*!< Description cluster: RAMn power control register                          */
  __OM  uint32_t  POWERSET;                     /*!< Description cluster: RAMn power control set register                      */
  __OM  uint32_t  POWERCLR;                     /*!< Description cluster: RAMn power control clear register                    */
  __IM  uint32_t  RESERVED;
} VMC_RAM_Type;                                 /*!< Size = 16 (0x10)                                                          */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          FICR_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Factory Information Configuration Registers (FICR_S)
  */

typedef struct {                                /*!< FICR_S Structure                                                          */
  __IM  uint32_t  RESERVED[128];
  __IOM FICR_INFO_Type INFO;                    /*!< Device info                                                               */
  __IM  uint32_t  RESERVED1[53];
  __IOM FICR_TRIMCNF_Type TRIMCNF[256];         /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED2[64];
  __IOM FICR_TRNG90B_Type TRNG90B;              /*!< NIST800-90B RNG calibration data                                          */
} NRF_FICR_Type;                                /*!< Size = 3104 (0xc20)                                                       */



/* =========================================================================================================================== */
/* ================                                          UICR_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief User information configuration registers User information configuration registers (UICR_S)
  */

typedef struct {                                /*!< UICR_S Structure                                                          */
  __IOM uint32_t  APPROTECT;                    /*!< Access port protection                                                    */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  XOSC32M;                      /*!< Oscillator control                                                        */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  HFXOSRC;                      /*!< HFXO clock source selection                                               */
  __IOM uint32_t  HFXOCNT;                      /*!< HFXO startup counter                                                      */
  __IOM uint32_t  APPNVMCPOFGUARD;              /*!< Enable blocking NVM WRITE and aborting NVM ERASE for Application
                                                     NVM in POFWARN condition.                                                 */
  __IOM uint32_t  PMICCONF;                     /*!< Polarity of PMIC polarity configuration signals.                          */
  __IOM uint32_t  SECUREAPPROTECT;              /*!< Secure access port protection                                             */
  __IOM uint32_t  ERASEPROTECT;                 /*!< Erase protection                                                          */
  __IM  uint32_t  RESERVED2[53];
  __IOM uint32_t  OTP[190];                     /*!< Description collection: One time programmable memory                      */
  __IOM UICR_KEYSLOT_Type KEYSLOT;              /*!< Unspecified                                                               */
} NRF_UICR_Type;                                /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                          ETM_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded Trace Macrocell (ETM_NS)
  */

