NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< ETM_NS Structure                                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TRCPRGCTLR;                   /*!< Enables the trace unit.                                                   */
  __IOM uint32_t  TRCPROCSELR;                  /*!< Controls which PE to trace. Might ignore writes when the trace
                                                     unit is enabled or not idle. Before writing to this register,
                                                     ensure that TRCSTATR.IDLE == 1 so that the trace unit can
                                                     synchronize with the chosen PE. Implemented if TRCIDR3.NUMPROC
                                                     is greater than zero.                                                     */
  __IOM uint32_t  TRCSTATR;                     /*!< Idle status bit                                                           */
  __IOM uint32_t  TRCCONFIGR;                   /*!< Controls the tracing options This register must always be programmed
                                                     as part of trace unit initialization. Might ignore writes
                                                     when the trace unit is enabled or not idle.                               */
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  TRCEVENTCTL0R;                /*!< Controls the tracing of arbitrary events. If the selected event
                                                     occurs a trace element is generated in the trace stream
                                                     according to the settings in TRCEVENTCTL1R.DATAEN and TRCEVENTCTL1R.INSTE
                                                     .                                                                         */
  __IOM uint32_t  TRCEVENTCTL1R;                /*!< Controls the behavior of the events that TRCEVENTCTL0R selects.
                                                     This register must always be programmed as part of trace
                                                     unit initialization. Might ignore writes when the trace
                                                     unit is enabled or not idle.                                              */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  TRCSTALLCTLR;                 /*!< Enables trace unit functionality that prevents trace unit buffer
                                                     overflows. Might ignore writes when the trace unit is enabled
                                                     or not idle. Must be programmed if TRCIDR3.STALLCTL ==
                                                     1.                                                                        */
  __IOM uint32_t  TRCTSCTLR;                    /*!< Controls the insertion of global timestamps in the trace streams.
                                                     When the selected event is triggered, the trace unit inserts
                                                     a global timestamp into the trace streams. Might ignore
                                                     writes when the trace unit is enabled or not idle. Must
                                                     be programmed if TRCCONFIGR.TS == 1.                                      */
  __IOM uint32_t  TRCSYNCPR;                    /*!< Controls how often trace synchronization requests occur. Might
                                                     ignore writes when the trace unit is enabled or not idle.
                                                     If writes are permitted then the register must be programmed.             */
  __IOM uint32_t  TRCCCCTLR;                    /*!< Sets the threshold value for cycle counting. Might ignore writes
                                                     when the trace unit is enabled or not idle. Must be programmed
                                                     if TRCCONFIGR.CCI==1.                                                     */
  __IOM uint32_t  TRCBBCTLR;                    /*!< Controls which regions in the memory map are enabled to use
                                                     branch broadcasting. Might ignore writes when the trace
                                                     unit is enabled or not idle. Must be programmed if TRCCONFIGR.BB
                                                     == 1.                                                                     */
  __IOM uint32_t  TRCTRACEIDR;                  /*!< Sets the trace ID for instruction trace. If data trace is enabled
                                                     then it also sets the trace ID for data trace, to (trace
                                                     ID for instruction trace) + 1. This register must always
                                                     be programmed as part of trace unit initialization. Might
                                                     ignore writes when the trace unit is enabled or not idle.                 */
  __IOM uint32_t  TRCQCTLR;                     /*!< Controls when Q elements are enabled. Might ignore writes when
                                                     the trace unit is enabled or not idle. This register must
                                                     be programmed if it is implemented and TRCCONFIGR.QE is
                                                     set to any value other than 0b00.                                         */
  __IM  uint32_t  RESERVED3[14];
  __IOM uint32_t  TRCVICTLR;                    /*!< Controls instruction trace filtering. Might ignore writes when
                                                     the trace unit is enabled or not idle. Only returns stable
                                                     data when TRCSTATR.PMSTABLE == 1. Must be programmed, particularly
                                                     to set the value of the SSSTATUS bit, which sets the state
                                                     of the start/stop logic.                                                  */
  __IOM uint32_t  TRCVIIECTLR;                  /*!< ViewInst exclude control. Might ignore writes when the trace
                                                     unit is enabled or not idle. This register must be programmed
                                                     when one or more address comparators are implemented.                     */
  __IOM uint32_t  TRCVISSCTLR;                  /*!< Use this to set, or read, the single address comparators that
                                                     control the ViewInst start/stoplogic. The start/stop logic
                                                     is active for an instruction which causes a start and remains
                                                     activeup to and including an instruction which causes a
                                                     stop, and then the start/stop logic becomesinactive. Might
                                                     ignore writes when the trace unit is enabled or not idle.
                                                     If implemented then this register must be programmed.                     */
  __IOM uint32_t  TRCVIPCSSCTLR;                /*!< Use this to set, or read, which PE comparator inputs can control
                                                     the ViewInst start/stop logic. Might ignore writes when
                                                     the trace unit is enabled or not idle. If implemented then
                                                     this register must be programmed.                                         */
  __IM  uint32_t  RESERVED4[4];
  __IOM uint32_t  TRCVDCTLR;                    /*!< Controls data trace filtering. Might ignore writes when the
                                                     trace unit is enabled or not idle. This register must be
                                                     programmed when data tracing is enabled, that is, when
                                                     either TRCCONFIGR.DA == 1 or TRCCONFIGR.DV == 1.                          */
  __IOM uint32_t  TRCVDSACCTLR;                 /*!< ViewData include / exclude control. Might ignore writes when
                                                     the trace unit is enabled or not idle. This register must
                                                     be programmed when one or more address comparators are
                                                     implemented.                                                              */
  __IOM uint32_t  TRCVDARCCTLR;                 /*!< ViewData include / exclude control. Might ignore writes when
                                                     the trace unit is enabled or not idle. This register must
                                                     be programmed when one or more address comparators are
                                                     implemented.                                                              */
  __IM  uint32_t  RESERVED5[21];
  __IOM uint32_t  TRCSEQEVR[3];                 /*!< Description collection: Moves the sequencer state according
                                                     to programmed events. Might ignore writes when the trace
                                                     unit is enabled or not idle. When the sequencer is used,
                                                     all sequencer state transitions must be programmed with
                                                     a valid event.                                                            */
  __IM  uint32_t  RESERVED6[3];
  __IOM uint32_t  TRCSEQRSTEVR;                 /*!< Moves the sequencer to state 0 when a programmed event occurs.
                                                     Might ignore writes when the trace unit is enabled or not
                                                     idle. When the sequencer is used, all sequencer state transitions
                                                     must be programmed with a valid event.                                    */
  __IOM uint32_t  TRCSEQSTR;                    /*!< Use this to set, or read, the sequencer state. Might ignore
                                                     writes when the trace unit is enabled or not idle. Only
                                                     returns stable data when TRCSTATR.PMSTABLE == 1. When the
                                                     sequencer is used, all sequencer state transitions must
                                                     be programmed with a valid event.                                         */
  __IOM uint32_t  TRCEXTINSELR;                 /*!< Use this to set, or read, which external inputs are resources
                                                     to the trace unit. Might ignore writes when the trace unit
                                                     is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE
                                                     == 1. When the sequencer is used, all sequencer state transitions
                                                     must be programmed with a valid event.                                    */
  __IM  uint32_t  RESERVED7[7];
  __IOM uint32_t  TRCCNTRLDVR[4];               /*!< Description collection: This sets or returns the reload count
                                                     value for counter n. Might ignore writes when the trace
                                                     unit is enabled or not idle.                                              */
  __IOM uint32_t  TRCCNTCTLR[4];                /*!< Description collection: Controls the operation of counter n.
                                                     Might ignore writes when the trace unit is enabled or not
                                                     idle.                                                                     */
  __IOM uint32_t  TRCCNTVR[4];                  /*!< Description collection: This sets or returns the value of counter
                                                     n. The count value is only stable when TRCSTATR.PMSTABLE
                                                     == 1. If software uses counter n then it must write to
                                                     this register to set the initial counter value. Might ignore
                                                     writes when the trace unit is enabled or not idle.                        */
  __IM  uint32_t  RESERVED8[36];
  __IOM uint32_t  TRCRSCTLR[30];                /*!< Description collection: Controls the selection of the resources
                                                     in the trace unit. Might ignore writes when the trace unit
                                                     is enabled or not idle. If software selects a non-implemented
                                                     resource then CONSTRAINED UNPREDICTABLEbehavior of the
                                                     resource selector occurs, so the resource selector might
                                                     fireunexpectedly or might not fire. Reads of the TRCRSCTLRn
                                                     might return UNKNOWN.                                                     */
  __IM  uint32_t  RESERVED9[2];
  __IOM uint32_t  TRCSSCCR0;                    /*!< Controls the single-shot comparator.                                      */
  __IM  uint32_t  RESERVED10[7];
  __IOM uint32_t  TRCSSCSR0;                    /*!< Indicates the status of the single-shot comparators. TRCSSCSR0
                                                     is sensitive toinstruction addresses.                                     */
  __IM  uint32_t  RESERVED11[7];
  __IOM uint32_t  TRCSSPCICR0;                  /*!< Selects the processor comparator inputs for Single-shot control.          */
  __IM  uint32_t  RESERVED12[19];
  __IOM uint32_t  TRCPDCR;                      /*!< Controls the single-shot comparator.                                      */
  __IOM uint32_t  TRCPDSR;                      /*!< Indicates the power down status of the ETM.                               */
  __IM  uint32_t  RESERVED13[755];
  __IOM uint32_t  TRCITATBIDR;                  /*!< Sets the state of output pins.                                            */
  __IM  uint32_t  RESERVED14[3];
  __IOM uint32_t  TRCITIATBINR;                 /*!< Reads the state of the input pins.                                        */
  __IM  uint32_t  RESERVED15;
  __IOM uint32_t  TRCITIATBOUTR;                /*!< Sets the state of the output pins.                                        */
  __IOM uint32_t  TRCITCTRL;                    /*!< Enables topology detection or integration testing, by putting
                                                     ETM-M33 into integration mode.                                            */
  __IM  uint32_t  RESERVED16[39];
  __IOM uint32_t  TRCCLAIMSET;                  /*!< Sets bits in the claim tag and determines the number of claim
                                                     tag bits implemented.                                                     */
  __IOM uint32_t  TRCCLAIMCLR;                  /*!< Clears bits in the claim tag and determines the current value
                                                     of the claim tag.                                                         */
  __IM  uint32_t  RESERVED17[4];
  __IOM uint32_t  TRCAUTHSTATUS;                /*!< Indicates the current level of tracing permitted by the system            */
  __IM  uint32_t  TRCDEVARCH;                   /*!< The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component                 */
  __IM  uint32_t  RESERVED18[3];
  __IM  uint32_t  TRCDEVTYPE;                   /*!< Controls the single-shot comparator.                                      */
  __IOM uint32_t  TRCPIDR[8];                   /*!< Description collection: Coresight peripheral identification
                                                     registers.                                                                */
  __IOM uint32_t  TRCCIDR[4];                   /*!< Description collection: Coresight component identification registers.     */
} NRF_ETM_Type;                                 /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                          ETB_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded Trace Buffer (ETB_NS)
  */

typedef struct {                                /*!< ETB_NS Structure                                                          */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  RDP;                          /*!< ETB RAM Depth Register                                                    */
  __IM  uint32_t  RESERVED1;
  __IM  uint32_t  STS;                          /*!< ETB Status Register                                                       */
  __IM  uint32_t  RRD;                          /*!< ETB RAM Read Data Register                                                */
  __IOM uint32_t  RRP;                          /*!< ETB RAM Read Pointer Register                                             */
  __IOM uint32_t  RWP;                          /*!< ETB RAM Write Pointer Register                                            */
  __IOM uint32_t  TRG;                          /*!< ETB Trigger Counter Register                                              */
  __IOM uint32_t  CTL;                          /*!< ETB Control Register                                                      */
  __IOM uint32_t  RWD;                          /*!< ETB RAM Write Data Register                                               */
  __IM  uint32_t  RESERVED2[182];
  __IM  uint32_t  FFSR;                         /*!< ETB Formatter and Flush Status Register                                   */
  __IOM uint32_t  FFCR;                         /*!< ETB Formatter and Flush Control Register                                  */
  __IM  uint32_t  RESERVED3[758];
  __OM  uint32_t  ITMISCOP0;                    /*!< Integration Test Miscellaneous Output Register 0                          */
  __OM  uint32_t  ITTRFLINACK;                  /*!< Integration Test Trigger In and Flush In Acknowledge Register             */
  __IM  uint32_t  ITTRFLIN;                     /*!< Integration Test Trigger In and Flush In Register                         */
  __IM  uint32_t  ITATBDATA0;                   /*!< Integration Test ATB Data Register 0                                      */
  __OM  uint32_t  ITATBCTR2;                    /*!< Integration Test ATB Control Register 2                                   */
  __IM  uint32_t  ITATBCTR1;                    /*!< Integration Test ATB Control Register 1                                   */
  __IM  uint32_t  ITATBCTR0;                    /*!< Integration Test ATB Control Register 0                                   */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  ITCTRL;                       /*!< Integration Mode Control Register                                         */
  __IM  uint32_t  RESERVED5[39];
  __IOM uint32_t  CLAIMSET;                     /*!< Claim Tag Set Register                                                    */
  __IOM uint32_t  CLAIMCLR;                     /*!< Claim Tag Clear Register                                                  */
  __IM  uint32_t  RESERVED6[2];
  __OM  uint32_t  LAR;                          /*!< Lock Access Register                                                      */
  __IM  uint32_t  LSR;                          /*!< Lock Status Register                                                      */
  __IM  uint32_t  AUTHSTATUS;                   /*!< Authentication Status Register                                            */
  __IM  uint32_t  RESERVED7[3];
  __IM  uint32_t  DEVID;                        /*!< Device Configuration Register                                             */
  __IM  uint32_t  DEVTYPE;                      /*!< Device Type Identifier Register                                           */
  __IM  uint32_t  PERIPHID4;                    /*!< Peripheral ID4 Register                                                   */
  __IM  uint32_t  RESERVED8[3];
  __IM  uint32_t  PERIPHID0;                    /*!< Peripheral ID0 Register                                                   */
  __IM  uint32_t  PERIPHID1;                    /*!< Peripheral ID1 Register                                                   */
  __IM  uint32_t  PERIPHID2;                    /*!< Peripheral ID2 Register                                                   */
  __IM  uint32_t  PERIPHID3;                    /*!< Peripheral ID3 Register                                                   */
  __IM  uint32_t  COMPID0;                      /*!< Component ID0 Register                                                    */
  __IM  uint32_t  COMPID1;                      /*!< Component ID1 Register                                                    */
  __IM  uint32_t  COMPID2;                      /*!< Component ID2 Register                                                    */
  __IM  uint32_t  COMPID3;                      /*!< Component ID3 Register                                                    */
} NRF_ETB_Type;                                 /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                          TPIU_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Trace Port Interface Unit (TPIU_NS)
  */

