NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< TPIU_NS Structure                                                         */
  __IOM uint32_t  SUPPORTEDPORTSIZES;           /*!< Each bit location is a single port size that is supported on
                                                     the device.                                                               */
  __IOM uint32_t  CURRENTPORTSIZE;              /*!< Each bit location is a single port size. One bit can be set,
                                                     and indicates the current port size.                                      */
  __IM  uint32_t  RESERVED[62];
  __IOM uint32_t  SUPPORTEDTRIGGERMODES;        /*!< The Supported_trigger_modes register indicates the implemented
                                                     trigger counter multipliers and other supported features
                                                     of the trigger system.                                                    */
  __IOM uint32_t  TRIGGERCOUNTERVALUE;          /*!< The Trigger_counter_value register enables delaying the indication
                                                     of triggers to any external connected trace capture or
                                                     storage devices.                                                          */
  __IOM uint32_t  TRIGGERMULTIPLIER;            /*!< The Trigger_multiplier register contains the selectors for the
                                                     trigger counter multiplier.                                               */
  __IM  uint32_t  RESERVED1[61];
  __IOM uint32_t  SUPPPORTEDTESTPATTERNMODES;   /*!< The Supported_test_pattern_modes register provides a set of
                                                     known bit sequences or patterns that can be output over
                                                     the trace port and can be detected by the TPA or other
                                                     associated trace capture device.                                          */
  __IOM uint32_t  CURRENTTESTPATTERNMODES;      /*!< Current_test_pattern_mode indicates the current test pattern
                                                     or mode selected.                                                         */
  __IOM uint32_t  TPRCR;                        /*!< The TPRCR register is an 8-bit counter start value that is decremented.
                                                     A write sets the initial counter value and a read returns
                                                     the programmed value.                                                     */
  __IM  uint32_t  RESERVED2[61];
  __IOM uint32_t  FFSR;                         /*!< The FFSR register indicates the current status of the formatter
                                                     and flush features available in the TPIU.                                 */
  __IOM uint32_t  FFCR;                         /*!< The FFCR register controls the generation of stop, trigger,
                                                     and flush events.                                                         */
  __IOM uint32_t  FSCR;                         /*!< The FSCR register enables the frequency of synchronization information
                                                     to be optimized to suit the Trace Port Analyzer (TPA) capture
                                                     buffer size.                                                              */
  __IM  uint32_t  RESERVED3[61];
  __IOM uint32_t  EXTCTLINPORT;                 /*!< Two ports can be used as a control and feedback mechanism for
                                                     any serializers, pin sharing multiplexers, or other solutions
                                                     that might be added to the trace output pins either for
                                                     pin control or a high-speed trace port solution.                          */
  __IOM uint32_t  EXTCTLOUTPORT;                /*!< Two ports can be used as a control and feedback mechanism for
                                                     any serializers, pin sharing multiplexers, or other solutions
                                                     that might be added to the trace output pins either for
                                                     pin control or a high speed trace port solution. These
                                                     ports are raw register banks that sample or export the
                                                     corresponding external pins.                                              */
  __IM  uint32_t  RESERVED4[695];
  __IOM uint32_t  ITTRFLINACK;                  /*!< The ITTRFLINACK register enables control of the triginack and
                                                     flushinack outputs from the TPIU.                                         */
  __IOM uint32_t  ITTRFLIN;                     /*!< The ITTRFLIN register contains the values of the flushin and
                                                     trigin inputs to the TPIU.                                                */
  __IOM uint32_t  ITATBDATA0;                   /*!< The ITATBDATA0 register contains the value of the atdatas inputs
                                                     to the TPIU. The values are valid only when atvalids is
                                                     HIGH.                                                                     */
  __IOM uint32_t  ITATBCTR2;                    /*!< Enables control of the atreadys and afvalids outputs of the
                                                     TPIU.                                                                     */
  __IOM uint32_t  ITATBCTR1;                    /*!< The ITATBCTR1 register contains the value of the atids input
                                                     to the TPIU. This is only valid when atvalids is HIGH.                    */
  __IOM uint32_t  ITATBCTR0;                    /*!< The ITATBCTR0 register captures the values of the atvalids,
                                                     afreadys, and atbytess inputs to the TPIU. To ensure the
                                                     integration registers work correctly in a system, the value
                                                     of atbytess is only valid when atvalids, bit[0], is HIGH.                 */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  ITCTRL;                       /*!< Used to enable topology detection. This register enables the
                                                     component to switch from a functional mode, the default
                                                     behavior, to integration mode where the inputs and outputs
                                                     of the component can be directly controlled for integration
                                                     testing and topology solving.                                             */
  __IM  uint32_t  RESERVED6[39];
  __IOM uint32_t  CLAIMSET;                     /*!< Software can use the claim tag to coordinate application and
                                                     debugger access to trace unit functionality. The claim
                                                     tags have no effect on the operation of the component.
                                                     The CLAIMSET register sets bits in the claim tag, and determines
                                                     the number of claim bits implemented.                                     */
  __IOM uint32_t  CLAIMCLR;                     /*!< Software can use the claim tag to coordinate application and
                                                     debugger access to trace unit functionality. The claim
                                                     tags have no effect on the operation of the component.
                                                     The CLAIMCLR register sets the bits in the claim tag to
                                                     0 and determines the current value of the claim tag.                      */
  __IM  uint32_t  RESERVED7[2];
  __IOM uint32_t  LAR;                          /*!< This is used to enable write access to device registers.                  */
  __IOM uint32_t  LSR;                          /*!< This indicates the status of the lock control mechanism. This
                                                     lock prevents accidental writes by code under debug. Accesses
                                                     to the extended stimulus port registers are not affected
                                                     by the lock mechanism. This register must always be present
                                                     although there might not be any lock access control mechanism.
                                                     The lock mechanism, where present and locked, must block
                                                     write accesses to any control register, except the Lock
                                                     Access Register. For most components this covers all registers
                                                     except for the Lock Access Register.                                      */
  __IOM uint32_t  AUTHSTATUS;                   /*!< Indicates the current level of tracing permitted by the system            */
  __IM  uint32_t  RESERVED8[3];
  __IM  uint32_t  DEVID;                        /*!< Indicates the capabilities of the component.                              */
  __IM  uint32_t  DEVTYPE;                      /*!< The DEVTYPE register provides a debugger with information about
                                                     the component when the Part Number field is not recognized.
                                                     The debugger can then report this information.                            */
  __IOM uint32_t  PIDR4;                        /*!< Coresight peripheral identification registers.                            */
  __IM  uint32_t  RESERVED9[3];
  __IOM uint32_t  PIDR_0;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_1;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_2;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_3;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  CIDR_0;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_1;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_2;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_3;                       /*!< Coresight component identification registers.                             */
} NRF_TPIU_Type;                                /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                     ATBREPLICATOR_NS                                      ================ */
/* =========================================================================================================================== */


/**
  * @brief ATB Replicator module (ATBREPLICATOR_NS)
  */

typedef struct {                                /*!< ATBREPLICATOR_NS Structure                                                */
  __IOM uint32_t  IDFILTER0;                    /*!< The IDFILTER0 register enables the programming of ID filtering
                                                     for master port 0.                                                        */
  __IOM uint32_t  IDFILTER1;                    /*!< The IDFILTER1 register enables the programming of ID filtering
                                                     for master port 1.                                                        */
  __IM  uint32_t  RESERVED[956];
  __IOM uint32_t  ITATBCTR1;                    /*!< The ITATBCTR1 register returns the value of the atreadym0, atreadym1,
                                                     and atvalids inputs in integration mode.                                  */
  __IOM uint32_t  ITATBCTR0;                    /*!< The ITATBCTR0 register controls the value of the atvalidm0,
                                                     atvalidm1, and atreadys outputs in integration mode.                      */
  __IOM uint32_t  ITCTRL;                       /*!< The ITCTRL register enables the component to switch from a functional
                                                     mode, which is the default behavior, to integration mode
                                                     where the inputs and outputs of the component can be directly
                                                     controlled for the purposes of integration testing and
                                                     topology detection.                                                       */
  __IM  uint32_t  RESERVED1[39];
  __IOM uint32_t  CLAIMSET;                     /*!< Software can use the claim tag to coordinate application and
                                                     debugger access to trace unit functionality. The claim
                                                     tags have no effect on the operation of the component.
                                                     The CLAIMSET register sets bits in the claim tag, and determines
                                                     the number of claim bits implemented.                                     */
  __IOM uint32_t  CLAIMCLR;                     /*!< Software can use the claim tag to coordinate application and
                                                     debugger access to trace unit functionality. The claim
                                                     tags have no effect on the operation of the component.
                                                     The CLAIMCLR register sets the bits in the claim tag to
                                                     0 and determines the current value of the claim tag.                      */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  LAR;                          /*!< This is used to enable write access to device registers.                  */
  __IOM uint32_t  LSR;                          /*!< This indicates the status of the lock control mechanism. This
                                                     lock prevents accidental writes by code under debug. Accesses
                                                     to the extended stimulus port registers are not affected
                                                     by the lock mechanism. This register must always be present
                                                     although there might not be any lock access control mechanism.
                                                     The lock mechanism, where present and locked, must block
                                                     write accesses to any control register, except the Lock
                                                     Access Register. For most components this covers all registers
                                                     except for the Lock Access Register.                                      */
  __IOM uint32_t  AUTHSTATUS;                   /*!< Indicates the current level of tracing permitted by the system            */
  __IM  uint32_t  RESERVED3[3];
  __IM  uint32_t  DEVID;                        /*!< Indicates the capabilities of the component.                              */
  __IM  uint32_t  DEVTYPE;                      /*!< The DEVTYPE register provides a debugger with information about
                                                     the component when the Part Number field is not recognized.
                                                     The debugger can then report this information.                            */
  __IOM uint32_t  PIDR4;                        /*!< Coresight peripheral identification registers.                            */
  __IM  uint32_t  RESERVED4[3];
  __IOM uint32_t  PIDR_0;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_1;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_2;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_3;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  CIDR_0;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_1;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_2;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_3;                       /*!< Coresight component identification registers.                             */
} NRF_ATBREPLICATOR_Type;                       /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                       ATBFUNNEL1_NS                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief ATB funnel module 0 (ATBFUNNEL1_NS)
  */

