NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< ATBFUNNEL1_NS Structure                                                   */
  __IOM uint32_t  CTRLREG;                      /*!< The IDFILTER0 register enables the programming of ID filtering
                                                     for master port 0.                                                        */
  __IOM uint32_t  PRIORITYCTRLREG;              /*!< The Priority_Ctrl_Reg register defines the order in which inputs
                                                     are selected. Each 3-bit field is a priority for each particular
                                                     slave interface.                                                          */
  __IM  uint32_t  RESERVED[953];
  __IOM uint32_t  ITATBDATA0;                   /*!< The ITATBDATA0 register performs different functions depending
                                                     on whether the access is a read or a write.                               */
  __IOM uint32_t  ITATBCTR2;                    /*!< The ITATBCTR2 register performs different functions depending
                                                     on whether the access is a read or a write.                               */
  __IOM uint32_t  ITATBCTR1;                    /*!< The ITATBCTR1 register performs different functions depending
                                                     on whether the access is a read or a write.                               */
  __IOM uint32_t  ITATBCTR0;                    /*!< The ITATBCTR0 register performs different functions depending
                                                     on whether the access is a read or a write.                               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  ITCTRL;                       /*!< The ITCTRL register enables the component to switch from a functional
                                                     mode, which is the default behavior, to integration mode
                                                     where the inputs and outputs of the component can be directly
                                                     controlled for the purposes of integration testing and
                                                     topology detection.                                                       */
  __IM  uint32_t  RESERVED2[39];
  __IOM uint32_t  CLAIMSET;                     /*!< Software can use the claim tag to coordinate application and
                                                     debugger access to trace unit functionality. The claim
                                                     tags have no effect on the operation of the component.
                                                     The CLAIMSET register sets bits in the claim tag, and determines
                                                     the number of claim bits implemented.                                     */
  __IOM uint32_t  CLAIMCLR;                     /*!< Software can use the claim tag to coordinate application and
                                                     debugger access to trace unit functionality. The claim
                                                     tags have no effect on the operation of the component.
                                                     The CLAIMCLR register sets the bits in the claim tag to
                                                     0 and determines the current value of the claim tag.                      */
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  LAR;                          /*!< This is used to enable write access to device registers.                  */
  __IOM uint32_t  LSR;                          /*!< This indicates the status of the lock control mechanism. This
                                                     lock prevents accidental writes by code under debug. Accesses
                                                     to the extended stimulus port registers are not affected
                                                     by the lock mechanism. This register must always be present
                                                     although there might not be any lock access control mechanism.
                                                     The lock mechanism, where present and locked, must block
                                                     write accesses to any control register, except the Lock
                                                     Access Register. For most components this covers all registers
                                                     except for the Lock Access Register.                                      */
  __IOM uint32_t  AUTHSTATUS;                   /*!< Indicates the current level of tracing permitted by the system            */
  __IM  uint32_t  RESERVED4[3];
  __IM  uint32_t  DEVID;                        /*!< Indicates the capabilities of the component.                              */
  __IM  uint32_t  DEVTYPE;                      /*!< The DEVTYPE register provides a debugger with information about
                                                     the component when the Part Number field is not recognized.
                                                     The debugger can then report this information.                            */
  __IOM uint32_t  PIDR4;                        /*!< Coresight peripheral identification registers.                            */
  __IM  uint32_t  RESERVED5[3];
  __IOM uint32_t  PIDR_0;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_1;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_2;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  PIDR_3;                       /*!< Coresight peripheral identification registers.                            */
  __IOM uint32_t  CIDR_0;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_1;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_2;                       /*!< Coresight component identification registers.                             */
  __IOM uint32_t  CIDR_3;                       /*!< Coresight component identification registers.                             */
} NRF_ATBFUNNEL_Type;                           /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                           TAD_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Trace and debug control (TAD_S)
  */

typedef struct {                                /*!< TAD_S Structure                                                           */
  __OM  uint32_t  TASKS_CLOCKSTART;             /*!< Start all trace and debug clocks.                                         */
  __OM  uint32_t  TASKS_CLOCKSTOP;              /*!< Stop all trace and debug clocks.                                          */
  __IM  uint32_t  RESERVED[318];
  __IOM uint32_t  ENABLE;                       /*!< Enable debug domain and aquire selected GPIOs                             */
  __IOM TAD_PSEL_Type PSEL;                     /*!< Unspecified                                                               */
  __IOM uint32_t  TRACEPORTSPEED;               /*!< Clocking options for the Trace Port debug interface Reset behavior
                                                     is the same as debug components                                           */
} NRF_TAD_Type;                                 /*!< Size = 1308 (0x51c)                                                       */



/* =========================================================================================================================== */
/* ================                                           SPU_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System protection unit (SPU_S)
  */

