NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< SPU_S Structure                                                           */
  __IM  uint32_t  RESERVED[64];
  __IOM uint32_t  EVENTS_RAMACCERR;             /*!< A security violation has been detected for the RAM memory space           */
  __IOM uint32_t  EVENTS_FLASHACCERR;           /*!< A security violation has been detected for the flash memory
                                                     space                                                                     */
  __IOM uint32_t  EVENTS_PERIPHACCERR;          /*!< A security violation has been detected on one or several peripherals      */
  __IM  uint32_t  RESERVED1[29];
  __IOM uint32_t  PUBLISH_RAMACCERR;            /*!< Publish configuration for event RAMACCERR                                 */
  __IOM uint32_t  PUBLISH_FLASHACCERR;          /*!< Publish configuration for event FLASHACCERR                               */
  __IOM uint32_t  PUBLISH_PERIPHACCERR;         /*!< Publish configuration for event PERIPHACCERR                              */
  __IM  uint32_t  RESERVED2[93];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED3[61];
  __IM  uint32_t  CAP;                          /*!< Show implemented features for the current device                          */
  __IM  uint32_t  RESERVED4[15];
  __IOM SPU_EXTDOMAIN_Type EXTDOMAIN[1];        /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED5[15];
  __IOM SPU_DPPI_Type DPPI[1];                  /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED6[14];
  __IOM SPU_GPIOPORT_Type GPIOPORT[1];          /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED7[14];
  __IOM SPU_FLASHNSC_Type FLASHNSC[2];          /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED8[12];
  __IOM SPU_RAMNSC_Type RAMNSC[2];              /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED9[44];
  __IOM SPU_FLASHREGION_Type FLASHREGION[32];   /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED10[32];
  __IOM SPU_RAMREGION_Type RAMREGION[32];       /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED11[32];
  __IOM SPU_PERIPHID_Type PERIPHID[67];         /*!< Unspecified                                                               */
} NRF_SPU_Type;                                 /*!< Size = 2316 (0x90c)                                                       */



/* =========================================================================================================================== */
/* ================                                       REGULATORS_NS                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Voltage regulators control 0 (REGULATORS_NS)
  */

typedef struct {                                /*!< REGULATORS_NS Structure                                                   */
  __IM  uint32_t  RESERVED[320];
  __OM  uint32_t  SYSTEMOFF;                    /*!< System OFF register                                                       */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  EXTPOFCON;                    /*!< External power failure warning configuration                              */
  __IM  uint32_t  RESERVED2[24];
  __IOM uint32_t  DCDCEN;                       /*!< Enable a step-down DC/DC voltage regulator.                               */
} NRF_REGULATORS_Type;                          /*!< Size = 1404 (0x57c)                                                       */



/* =========================================================================================================================== */
/* ================                                         CLOCK_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock management 0 (CLOCK_NS)
  */

typedef struct {                                /*!< CLOCK_NS Structure                                                        */
  __OM  uint32_t  TASKS_HFCLKSTART;             /*!< Start HFCLK source                                                        */
  __OM  uint32_t  TASKS_HFCLKSTOP;              /*!< Stop HFCLK source                                                         */
  __OM  uint32_t  TASKS_LFCLKSTART;             /*!< Start LFCLK source                                                        */
  __OM  uint32_t  TASKS_LFCLKSTOP;              /*!< Stop LFCLK source                                                         */
  __IM  uint32_t  RESERVED[28];
  __IOM uint32_t  SUBSCRIBE_HFCLKSTART;         /*!< Subscribe configuration for task HFCLKSTART                               */
  __IOM uint32_t  SUBSCRIBE_HFCLKSTOP;          /*!< Subscribe configuration for task HFCLKSTOP                                */
  __IOM uint32_t  SUBSCRIBE_LFCLKSTART;         /*!< Subscribe configuration for task LFCLKSTART                               */
  __IOM uint32_t  SUBSCRIBE_LFCLKSTOP;          /*!< Subscribe configuration for task LFCLKSTOP                                */
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  EVENTS_HFCLKSTARTED;          /*!< HFCLK oscillator started                                                  */
  __IOM uint32_t  EVENTS_LFCLKSTARTED;          /*!< LFCLK started                                                             */
  __IM  uint32_t  RESERVED2[30];
  __IOM uint32_t  PUBLISH_HFCLKSTARTED;         /*!< Publish configuration for event HFCLKSTARTED                              */
  __IOM uint32_t  PUBLISH_LFCLKSTARTED;         /*!< Publish configuration for event LFCLKSTARTED                              */
  __IM  uint32_t  RESERVED3[94];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  INTPEND;                      /*!< Pending interrupts                                                        */
  __IM  uint32_t  RESERVED4[62];
  __IM  uint32_t  HFCLKRUN;                     /*!< Status indicating that HFCLKSTART task has been triggered                 */
  __IM  uint32_t  HFCLKSTAT;                    /*!< The register shows if HFXO has been requested by triggering
                                                     HFCLKSTART task and if it has been started (STATE).                       */
  __IM  uint32_t  RESERVED5;
  __IM  uint32_t  LFCLKRUN;                     /*!< Status indicating that LFCLKSTART task has been triggered                 */
  __IM  uint32_t  LFCLKSTAT;                    /*!< The register shows which LFCLK source has been requested (SRC)
                                                     when triggering LFCLKSTART task and if the source has been
                                                     started (STATE).                                                          */
  __IM  uint32_t  LFCLKSRCCOPY;                 /*!< Copy of LFCLKSRC register, set after LFCLKSTART task has been
                                                     triggered                                                                 */
  __IM  uint32_t  RESERVED6[62];
  __IOM uint32_t  LFCLKSRC;                     /*!< Clock source for the LFCLK. LFCLKSTART task starts a clock source
                                                     selected with this register.                                              */
} NRF_CLOCK_Type;                               /*!< Size = 1308 (0x51c)                                                       */



/* =========================================================================================================================== */
/* ================                                         POWER_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control 0 (POWER_NS)
  */

