NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< POWER_NS Structure                                                        */
  __IM  uint32_t  RESERVED[28];
  __OM  uint32_t  TASKS_PWMREQSTART;            /*!< Request forcing PWM mode in PMIC DC/DC buck regulator. (Drives
                                                     FPWM_DCDC pin high or low depending on a setting in UICR).                */
  __OM  uint32_t  TASKS_PWMREQSTOP;             /*!< Stop requesting forcing PWM mode in PMIC DC/DC buck regulator             */
  __OM  uint32_t  TASKS_CONSTLAT;               /*!< Enable constant latency mode.                                             */
  __OM  uint32_t  TASKS_LOWPWR;                 /*!< Enable low power mode (variable latency)                                  */
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  SUBSCRIBE_PWMREQSTART;        /*!< Subscribe configuration for task PWMREQSTART                              */
  __IOM uint32_t  SUBSCRIBE_PWMREQSTOP;         /*!< Subscribe configuration for task PWMREQSTOP                               */
  __IOM uint32_t  SUBSCRIBE_CONSTLAT;           /*!< Subscribe configuration for task CONSTLAT                                 */
  __IOM uint32_t  SUBSCRIBE_LOWPWR;             /*!< Subscribe configuration for task LOWPWR                                   */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  EVENTS_POFWARN;               /*!< Power failure warning                                                     */
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  EVENTS_SLEEPENTER;            /*!< CPU entered WFI/WFE sleep                                                 */
  __IOM uint32_t  EVENTS_SLEEPEXIT;             /*!< CPU exited WFI/WFE sleep                                                  */
  __IM  uint32_t  RESERVED4[27];
  __IOM uint32_t  PUBLISH_POFWARN;              /*!< Publish configuration for event POFWARN                                   */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  PUBLISH_SLEEPENTER;           /*!< Publish configuration for event SLEEPENTER                                */
  __IOM uint32_t  PUBLISH_SLEEPEXIT;            /*!< Publish configuration for event SLEEPEXIT                                 */
  __IM  uint32_t  RESERVED6[89];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED7[61];
  __IOM uint32_t  RESETREAS;                    /*!< Reset reason                                                              */
  __IM  uint32_t  RESERVED8[15];
  __IM  uint32_t  POWERSTATUS;                  /*!< Modem domain power status                                                 */
  __IM  uint32_t  RESERVED9[54];
  __IOM uint32_t  GPREGRET[2];                  /*!< Description collection: General purpose retention register                */
  __IM  uint32_t  RESERVED10[59];
  __IOM POWER_LTEMODEM_Type LTEMODEM;           /*!< LTE Modem                                                                 */
} NRF_POWER_Type;                               /*!< Size = 1560 (0x618)                                                       */



/* =========================================================================================================================== */
/* ================                                      CTRL_AP_PERI_S                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief Control access port (CTRL_AP_PERI_S)
  */

typedef struct {                                /*!< CTRL_AP_PERI_S Structure                                                  */
  __IM  uint32_t  RESERVED[256];
  __IOM CTRLAPPERI_MAILBOX_Type MAILBOX;        /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED1[30];
  __IOM CTRLAPPERI_ERASEPROTECT_Type ERASEPROTECT;/*!< Unspecified                                                             */
} NRF_CTRLAPPERI_Type;                          /*!< Size = 1288 (0x508)                                                       */



/* =========================================================================================================================== */
/* ================                                         SPIM0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial Peripheral Interface Master with EasyDMA 0 (SPIM0_NS)
  */

typedef struct {                                /*!< SPIM0_NS Structure                                                        */
  __IM  uint32_t  RESERVED[4];
  __OM  uint32_t  TASKS_START;                  /*!< Start SPI transaction                                                     */
  __OM  uint32_t  TASKS_STOP;                   /*!< Stop SPI transaction                                                      */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  TASKS_SUSPEND;                /*!< Suspend SPI transaction                                                   */
  __OM  uint32_t  TASKS_RESUME;                 /*!< Resume SPI transaction                                                    */
  __IM  uint32_t  RESERVED2[27];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  SUBSCRIBE_SUSPEND;            /*!< Subscribe configuration for task SUSPEND                                  */
  __IOM uint32_t  SUBSCRIBE_RESUME;             /*!< Subscribe configuration for task RESUME                                   */
  __IM  uint32_t  RESERVED4[24];
  __IOM uint32_t  EVENTS_STOPPED;               /*!< SPI transaction has stopped                                               */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  EVENTS_ENDRX;                 /*!< End of RXD buffer reached                                                 */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  EVENTS_END;                   /*!< End of RXD buffer and TXD buffer reached                                  */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  EVENTS_ENDTX;                 /*!< End of TXD buffer reached                                                 */
  __IM  uint32_t  RESERVED8[10];
  __IOM uint32_t  EVENTS_STARTED;               /*!< Transaction started                                                       */
  __IM  uint32_t  RESERVED9[13];
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IM  uint32_t  RESERVED10[2];
  __IOM uint32_t  PUBLISH_ENDRX;                /*!< Publish configuration for event ENDRX                                     */
  __IM  uint32_t  RESERVED11;
  __IOM uint32_t  PUBLISH_END;                  /*!< Publish configuration for event END                                       */
  __IM  uint32_t  RESERVED12;
  __IOM uint32_t  PUBLISH_ENDTX;                /*!< Publish configuration for event ENDTX                                     */
  __IM  uint32_t  RESERVED13[10];
  __IOM uint32_t  PUBLISH_STARTED;              /*!< Publish configuration for event STARTED                                   */
  __IM  uint32_t  RESERVED14[12];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED15[64];
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED16[125];
  __IOM uint32_t  ENABLE;                       /*!< Enable SPIM                                                               */
  __IM  uint32_t  RESERVED17;
  __IOM SPIM_PSEL_Type PSEL;                    /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED18[4];
  __IOM uint32_t  FREQUENCY;                    /*!< SPI frequency. Accuracy depends on the HFCLK source selected.             */
  __IM  uint32_t  RESERVED19[3];
  __IOM SPIM_RXD_Type RXD;                      /*!< RXD EasyDMA channel                                                       */
  __IOM SPIM_TXD_Type TXD;                      /*!< TXD EasyDMA channel                                                       */
  __IOM uint32_t  CONFIG;                       /*!< Configuration register                                                    */
  __IM  uint32_t  RESERVED20[26];
  __IOM uint32_t  ORC;                          /*!< Over-read character. Character clocked out in case an over-read
                                                     of the TXD buffer.                                                        */
} NRF_SPIM_Type;                                /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                         SPIS0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI Slave 0 (SPIS0_NS)
  */

typedef struct {                                /*!< SPIS0_NS Structure                                                        */
  __IM  uint32_t  RESERVED[9];
  __OM  uint32_t  TASKS_ACQUIRE;                /*!< Acquire SPI semaphore                                                     */
  __OM  uint32_t  TASKS_RELEASE;                /*!< Release SPI semaphore, enabling the SPI slave to acquire it               */
  __IM  uint32_t  RESERVED1[30];
  __IOM uint32_t  SUBSCRIBE_ACQUIRE;            /*!< Subscribe configuration for task ACQUIRE                                  */
  __IOM uint32_t  SUBSCRIBE_RELEASE;            /*!< Subscribe configuration for task RELEASE                                  */
  __IM  uint32_t  RESERVED2[22];
  __IOM uint32_t  EVENTS_END;                   /*!< Granted transaction completed                                             */
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  EVENTS_ENDRX;                 /*!< End of RXD buffer reached                                                 */
  __IM  uint32_t  RESERVED4[5];
  __IOM uint32_t  EVENTS_ACQUIRED;              /*!< Semaphore acquired                                                        */
  __IM  uint32_t  RESERVED5[22];
  __IOM uint32_t  PUBLISH_END;                  /*!< Publish configuration for event END                                       */
  __IM  uint32_t  RESERVED6[2];
  __IOM uint32_t  PUBLISH_ENDRX;                /*!< Publish configuration for event ENDRX                                     */
  __IM  uint32_t  RESERVED7[5];
  __IOM uint32_t  PUBLISH_ACQUIRED;             /*!< Publish configuration for event ACQUIRED                                  */
  __IM  uint32_t  RESERVED8[21];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED9[64];
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED10[61];
  __IM  uint32_t  SEMSTAT;                      /*!< Semaphore status register                                                 */
  __IM  uint32_t  RESERVED11[15];
  __IOM uint32_t  STATUS;                       /*!< Status from last transaction                                              */
  __IM  uint32_t  RESERVED12[47];
  __IOM uint32_t  ENABLE;                       /*!< Enable SPI slave                                                          */
  __IM  uint32_t  RESERVED13;
  __IOM SPIS_PSEL_Type PSEL;                    /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED14[7];
  __IOM SPIS_RXD_Type RXD;                      /*!< Unspecified                                                               */
  __IOM SPIS_TXD_Type TXD;                      /*!< Unspecified                                                               */
  __IOM uint32_t  CONFIG;                       /*!< Configuration register                                                    */
  __IM  uint32_t  RESERVED15;
  __IOM uint32_t  DEF;                          /*!< Default character. Character clocked out in case of an ignored
                                                     transaction.                                                              */
  __IM  uint32_t  RESERVED16[24];
  __IOM uint32_t  ORC;                          /*!< Over-read character                                                       */
} NRF_SPIS_Type;                                /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                         TWIM0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C compatible Two-Wire Master Interface with EasyDMA 0 (TWIM0_NS)
  */

typedef struct {                                /*!< TWIM0_NS Structure                                                        */
  __OM  uint32_t  TASKS_STARTRX;                /*!< Start TWI receive sequence                                                */
  __IM  uint32_t  RESERVED;
  __OM  uint32_t  TASKS_STARTTX;                /*!< Start TWI transmit sequence                                               */
  __IM  uint32_t  RESERVED1[2];
  __OM  uint32_t  TASKS_STOP;                   /*!< Stop TWI transaction. Must be issued while the TWI master is
                                                     not suspended.                                                            */
  __IM  uint32_t  RESERVED2;
  __OM  uint32_t  TASKS_SUSPEND;                /*!< Suspend TWI transaction                                                   */
  __OM  uint32_t  TASKS_RESUME;                 /*!< Resume TWI transaction                                                    */
  __IM  uint32_t  RESERVED3[23];
  __IOM uint32_t  SUBSCRIBE_STARTRX;            /*!< Subscribe configuration for task STARTRX                                  */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SUBSCRIBE_STARTTX;            /*!< Subscribe configuration for task STARTTX                                  */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  SUBSCRIBE_SUSPEND;            /*!< Subscribe configuration for task SUSPEND                                  */
  __IOM uint32_t  SUBSCRIBE_RESUME;             /*!< Subscribe configuration for task RESUME                                   */
  __IM  uint32_t  RESERVED7[24];
  __IOM uint32_t  EVENTS_STOPPED;               /*!< TWI stopped                                                               */
  __IM  uint32_t  RESERVED8[7];
  __IOM uint32_t  EVENTS_ERROR;                 /*!< TWI error                                                                 */
  __IM  uint32_t  RESERVED9[8];
  __IOM uint32_t  EVENTS_SUSPENDED;             /*!< SUSPEND task has been issued, TWI traffic is now suspended.               */
  __IOM uint32_t  EVENTS_RXSTARTED;             /*!< Receive sequence started                                                  */
  __IOM uint32_t  EVENTS_TXSTARTED;             /*!< Transmit sequence started                                                 */
  __IM  uint32_t  RESERVED10[2];
  __IOM uint32_t  EVENTS_LASTRX;                /*!< Byte boundary, starting to receive the last byte                          */
  __IOM uint32_t  EVENTS_LASTTX;                /*!< Byte boundary, starting to transmit the last byte                         */
  __IM  uint32_t  RESERVED11[8];
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IM  uint32_t  RESERVED12[7];
  __IOM uint32_t  PUBLISH_ERROR;                /*!< Publish configuration for event ERROR                                     */
  __IM  uint32_t  RESERVED13[8];
  __IOM uint32_t  PUBLISH_SUSPENDED;            /*!< Publish configuration for event SUSPENDED                                 */
  __IOM uint32_t  PUBLISH_RXSTARTED;            /*!< Publish configuration for event RXSTARTED                                 */
  __IOM uint32_t  PUBLISH_TXSTARTED;            /*!< Publish configuration for event TXSTARTED                                 */
  __IM  uint32_t  RESERVED14[2];
  __IOM uint32_t  PUBLISH_LASTRX;               /*!< Publish configuration for event LASTRX                                    */
  __IOM uint32_t  PUBLISH_LASTTX;               /*!< Publish configuration for event LASTTX                                    */
  __IM  uint32_t  RESERVED15[7];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED16[63];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED17[110];
  __IOM uint32_t  ERRORSRC;                     /*!< Error source                                                              */
  __IM  uint32_t  RESERVED18[14];
  __IOM uint32_t  ENABLE;                       /*!< Enable TWIM                                                               */
  __IM  uint32_t  RESERVED19;
  __IOM TWIM_PSEL_Type PSEL;                    /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED20[5];
  __IOM uint32_t  FREQUENCY;                    /*!< TWI frequency. Accuracy depends on the HFCLK source selected.             */
  __IM  uint32_t  RESERVED21[3];
  __IOM TWIM_RXD_Type RXD;                      /*!< RXD EasyDMA channel                                                       */
  __IOM TWIM_TXD_Type TXD;                      /*!< TXD EasyDMA channel                                                       */
  __IM  uint32_t  RESERVED22[13];
  __IOM uint32_t  ADDRESS;                      /*!< Address used in the TWI transfer                                          */
} NRF_TWIM_Type;                                /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                         TWIS0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C compatible Two-Wire Slave Interface with EasyDMA 0 (TWIS0_NS)
  */

