NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< TWIS0_NS Structure                                                        */
  __IM  uint32_t  RESERVED[5];
  __OM  uint32_t  TASKS_STOP;                   /*!< Stop TWI transaction                                                      */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  TASKS_SUSPEND;                /*!< Suspend TWI transaction                                                   */
  __OM  uint32_t  TASKS_RESUME;                 /*!< Resume TWI transaction                                                    */
  __IM  uint32_t  RESERVED2[3];
  __OM  uint32_t  TASKS_PREPARERX;              /*!< Prepare the TWI slave to respond to a write command                       */
  __OM  uint32_t  TASKS_PREPARETX;              /*!< Prepare the TWI slave to respond to a read command                        */
  __IM  uint32_t  RESERVED3[23];
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SUBSCRIBE_SUSPEND;            /*!< Subscribe configuration for task SUSPEND                                  */
  __IOM uint32_t  SUBSCRIBE_RESUME;             /*!< Subscribe configuration for task RESUME                                   */
  __IM  uint32_t  RESERVED5[3];
  __IOM uint32_t  SUBSCRIBE_PREPARERX;          /*!< Subscribe configuration for task PREPARERX                                */
  __IOM uint32_t  SUBSCRIBE_PREPARETX;          /*!< Subscribe configuration for task PREPARETX                                */
  __IM  uint32_t  RESERVED6[19];
  __IOM uint32_t  EVENTS_STOPPED;               /*!< TWI stopped                                                               */
  __IM  uint32_t  RESERVED7[7];
  __IOM uint32_t  EVENTS_ERROR;                 /*!< TWI error                                                                 */
  __IM  uint32_t  RESERVED8[9];
  __IOM uint32_t  EVENTS_RXSTARTED;             /*!< Receive sequence started                                                  */
  __IOM uint32_t  EVENTS_TXSTARTED;             /*!< Transmit sequence started                                                 */
  __IM  uint32_t  RESERVED9[4];
  __IOM uint32_t  EVENTS_WRITE;                 /*!< Write command received                                                    */
  __IOM uint32_t  EVENTS_READ;                  /*!< Read command received                                                     */
  __IM  uint32_t  RESERVED10[6];
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IM  uint32_t  RESERVED11[7];
  __IOM uint32_t  PUBLISH_ERROR;                /*!< Publish configuration for event ERROR                                     */
  __IM  uint32_t  RESERVED12[9];
  __IOM uint32_t  PUBLISH_RXSTARTED;            /*!< Publish configuration for event RXSTARTED                                 */
  __IOM uint32_t  PUBLISH_TXSTARTED;            /*!< Publish configuration for event TXSTARTED                                 */
  __IM  uint32_t  RESERVED13[4];
  __IOM uint32_t  PUBLISH_WRITE;                /*!< Publish configuration for event WRITE                                     */
  __IOM uint32_t  PUBLISH_READ;                 /*!< Publish configuration for event READ                                      */
  __IM  uint32_t  RESERVED14[5];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED15[63];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED16[113];
  __IOM uint32_t  ERRORSRC;                     /*!< Error source                                                              */
  __IM  uint32_t  MATCH;                        /*!< Status register indicating which address had a match                      */
  __IM  uint32_t  RESERVED17[10];
  __IOM uint32_t  ENABLE;                       /*!< Enable TWIS                                                               */
  __IM  uint32_t  RESERVED18;
  __IOM TWIS_PSEL_Type PSEL;                    /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED19[9];
  __IOM TWIS_RXD_Type RXD;                      /*!< RXD EasyDMA channel                                                       */
  __IOM TWIS_TXD_Type TXD;                      /*!< TXD EasyDMA channel                                                       */
  __IM  uint32_t  RESERVED20[13];
  __IOM uint32_t  ADDRESS[2];                   /*!< Description collection: TWI slave address n                               */
  __IM  uint32_t  RESERVED21;
  __IOM uint32_t  CONFIG;                       /*!< Configuration register for the address match mechanism                    */
  __IM  uint32_t  RESERVED22[10];
  __IOM uint32_t  ORC;                          /*!< Over-read character. Character sent out in case of an over-read
                                                     of the transmit buffer.                                                   */
} NRF_TWIS_Type;                                /*!< Size = 1476 (0x5c4)                                                       */



/* =========================================================================================================================== */
/* ================                                         UARTE0_NS                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief UART with EasyDMA 0 (UARTE0_NS)
  */

typedef struct {                                /*!< UARTE0_NS Structure                                                       */
  __OM  uint32_t  TASKS_STARTRX;                /*!< Start UART receiver                                                       */
  __OM  uint32_t  TASKS_STOPRX;                 /*!< Stop UART receiver                                                        */
  __OM  uint32_t  TASKS_STARTTX;                /*!< Start UART transmitter                                                    */
  __OM  uint32_t  TASKS_STOPTX;                 /*!< Stop UART transmitter                                                     */
  __IM  uint32_t  RESERVED[7];
  __OM  uint32_t  TASKS_FLUSHRX;                /*!< Flush RX FIFO into RX buffer                                              */
  __IM  uint32_t  RESERVED1[20];
  __IOM uint32_t  SUBSCRIBE_STARTRX;            /*!< Subscribe configuration for task STARTRX                                  */
  __IOM uint32_t  SUBSCRIBE_STOPRX;             /*!< Subscribe configuration for task STOPRX                                   */
  __IOM uint32_t  SUBSCRIBE_STARTTX;            /*!< Subscribe configuration for task STARTTX                                  */
  __IOM uint32_t  SUBSCRIBE_STOPTX;             /*!< Subscribe configuration for task STOPTX                                   */
  __IM  uint32_t  RESERVED2[7];
  __IOM uint32_t  SUBSCRIBE_FLUSHRX;            /*!< Subscribe configuration for task FLUSHRX                                  */
  __IM  uint32_t  RESERVED3[20];
  __IOM uint32_t  EVENTS_CTS;                   /*!< CTS is activated (set low). Clear To Send.                                */
  __IOM uint32_t  EVENTS_NCTS;                  /*!< CTS is deactivated (set high). Not Clear To Send.                         */
  __IOM uint32_t  EVENTS_RXDRDY;                /*!< Data received in RXD (but potentially not yet transferred to
                                                     Data RAM)                                                                 */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  EVENTS_ENDRX;                 /*!< Receive buffer is filled up                                               */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  EVENTS_TXDRDY;                /*!< Data sent from TXD                                                        */
  __IOM uint32_t  EVENTS_ENDTX;                 /*!< Last TX byte transmitted                                                  */
  __IOM uint32_t  EVENTS_ERROR;                 /*!< Error detected                                                            */
  __IM  uint32_t  RESERVED6[7];
  __IOM uint32_t  EVENTS_RXTO;                  /*!< Receiver timeout                                                          */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  EVENTS_RXSTARTED;             /*!< UART receiver has started                                                 */
  __IOM uint32_t  EVENTS_TXSTARTED;             /*!< UART transmitter has started                                              */
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  EVENTS_TXSTOPPED;             /*!< Transmitter stopped                                                       */
  __IM  uint32_t  RESERVED9[9];
  __IOM uint32_t  PUBLISH_CTS;                  /*!< Publish configuration for event CTS                                       */
  __IOM uint32_t  PUBLISH_NCTS;                 /*!< Publish configuration for event NCTS                                      */
  __IOM uint32_t  PUBLISH_RXDRDY;               /*!< Publish configuration for event RXDRDY                                    */
  __IM  uint32_t  RESERVED10;
  __IOM uint32_t  PUBLISH_ENDRX;                /*!< Publish configuration for event ENDRX                                     */
  __IM  uint32_t  RESERVED11[2];
  __IOM uint32_t  PUBLISH_TXDRDY;               /*!< Publish configuration for event TXDRDY                                    */
  __IOM uint32_t  PUBLISH_ENDTX;                /*!< Publish configuration for event ENDTX                                     */
  __IOM uint32_t  PUBLISH_ERROR;                /*!< Publish configuration for event ERROR                                     */
  __IM  uint32_t  RESERVED12[7];
  __IOM uint32_t  PUBLISH_RXTO;                 /*!< Publish configuration for event RXTO                                      */
  __IM  uint32_t  RESERVED13;
  __IOM uint32_t  PUBLISH_RXSTARTED;            /*!< Publish configuration for event RXSTARTED                                 */
  __IOM uint32_t  PUBLISH_TXSTARTED;            /*!< Publish configuration for event TXSTARTED                                 */
  __IM  uint32_t  RESERVED14;
  __IOM uint32_t  PUBLISH_TXSTOPPED;            /*!< Publish configuration for event TXSTOPPED                                 */
  __IM  uint32_t  RESERVED15[9];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED16[63];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED17[93];
  __IOM uint32_t  ERRORSRC;                     /*!< Error source This register is read/write one to clear.                    */
  __IM  uint32_t  RESERVED18[31];
  __IOM uint32_t  ENABLE;                       /*!< Enable UART                                                               */
  __IM  uint32_t  RESERVED19;
  __IOM UARTE_PSEL_Type PSEL;                   /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED20[3];
  __IOM uint32_t  BAUDRATE;                     /*!< Baud rate. Accuracy depends on the HFCLK source selected.                 */
  __IM  uint32_t  RESERVED21[3];
  __IOM UARTE_RXD_Type RXD;                     /*!< RXD EasyDMA channel                                                       */
  __IM  uint32_t  RESERVED22;
  __IOM UARTE_TXD_Type TXD;                     /*!< TXD EasyDMA channel                                                       */
  __IM  uint32_t  RESERVED23[7];
  __IOM uint32_t  CONFIG;                       /*!< Configuration of parity and hardware flow control                         */
} NRF_UARTE_Type;                               /*!< Size = 1392 (0x570)                                                       */



/* =========================================================================================================================== */
/* ================                                         GPIOTE0_S                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Tasks and Events 0 (GPIOTE0_S)
  */

typedef struct {                                /*!< GPIOTE0_S Structure                                                       */
  __OM  uint32_t  TASKS_OUT[8];                 /*!< Description collection: Task for writing to pin specified in
                                                     CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY.        */
  __IM  uint32_t  RESERVED[4];
  __OM  uint32_t  TASKS_SET[8];                 /*!< Description collection: Task for writing to pin specified in
                                                     CONFIG[n].PSEL. Action on pin is to set it high.                          */
  __IM  uint32_t  RESERVED1[4];
  __OM  uint32_t  TASKS_CLR[8];                 /*!< Description collection: Task for writing to pin specified in
                                                     CONFIG[n].PSEL. Action on pin is to set it low.                           */
  __IOM uint32_t  SUBSCRIBE_OUT[8];             /*!< Description collection: Subscribe configuration for task OUT[n]           */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  SUBSCRIBE_SET[8];             /*!< Description collection: Subscribe configuration for task SET[n]           */
  __IM  uint32_t  RESERVED3[4];
  __IOM uint32_t  SUBSCRIBE_CLR[8];             /*!< Description collection: Subscribe configuration for task CLR[n]           */
  __IOM uint32_t  EVENTS_IN[8];                 /*!< Description collection: Event generated from pin specified in
                                                     CONFIG[n].PSEL                                                            */
  __IM  uint32_t  RESERVED4[23];
  __IOM uint32_t  EVENTS_PORT;                  /*!< Event generated from multiple input GPIO pins with SENSE mechanism
                                                     enabled                                                                   */
  __IOM uint32_t  PUBLISH_IN[8];                /*!< Description collection: Publish configuration for event IN[n]             */
  __IM  uint32_t  RESERVED5[23];
  __IOM uint32_t  PUBLISH_PORT;                 /*!< Publish configuration for event PORT                                      */
  __IM  uint32_t  RESERVED6[65];
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED7[129];
  __IOM uint32_t  CONFIG[8];                    /*!< Description collection: Configuration for OUT[n], SET[n], and
                                                     CLR[n] tasks and IN[n] event                                              */
} NRF_GPIOTE_Type;                              /*!< Size = 1328 (0x530)                                                       */



/* =========================================================================================================================== */
/* ================                                         SAADC_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to Digital Converter 0 (SAADC_NS)
  */

typedef struct {                                /*!< SAADC_NS Structure                                                        */
  __OM  uint32_t  TASKS_START;                  /*!< Start the ADC and prepare the result buffer in RAM                        */
  __OM  uint32_t  TASKS_SAMPLE;                 /*!< Take one ADC sample, if scan is enabled all channels are sampled          */
  __OM  uint32_t  TASKS_STOP;                   /*!< Stop the ADC and terminate any on-going conversion                        */
  __OM  uint32_t  TASKS_CALIBRATEOFFSET;        /*!< Starts offset auto-calibration                                            */
  __IM  uint32_t  RESERVED[28];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IOM uint32_t  SUBSCRIBE_SAMPLE;             /*!< Subscribe configuration for task SAMPLE                                   */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IOM uint32_t  SUBSCRIBE_CALIBRATEOFFSET;    /*!< Subscribe configuration for task CALIBRATEOFFSET                          */
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  EVENTS_STARTED;               /*!< The ADC has started                                                       */
  __IOM uint32_t  EVENTS_END;                   /*!< The ADC has filled up the Result buffer                                   */
  __IOM uint32_t  EVENTS_DONE;                  /*!< A conversion task has been completed. Depending on the mode,
                                                     multiple conversions might be needed for a result to be
                                                     transferred to RAM.                                                       */
  __IOM uint32_t  EVENTS_RESULTDONE;            /*!< A result is ready to get transferred to RAM.                              */
  __IOM uint32_t  EVENTS_CALIBRATEDONE;         /*!< Calibration is complete                                                   */
  __IOM uint32_t  EVENTS_STOPPED;               /*!< The ADC has stopped                                                       */
  __IOM SAADC_EVENTS_CH_Type EVENTS_CH[8];      /*!< Peripheral events.                                                        */
  __IM  uint32_t  RESERVED2[10];
  __IOM uint32_t  PUBLISH_STARTED;              /*!< Publish configuration for event STARTED                                   */
  __IOM uint32_t  PUBLISH_END;                  /*!< Publish configuration for event END                                       */
  __IOM uint32_t  PUBLISH_DONE;                 /*!< Publish configuration for event DONE                                      */
  __IOM uint32_t  PUBLISH_RESULTDONE;           /*!< Publish configuration for event RESULTDONE                                */
  __IOM uint32_t  PUBLISH_CALIBRATEDONE;        /*!< Publish configuration for event CALIBRATEDONE                             */
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IOM SAADC_PUBLISH_CH_Type PUBLISH_CH[8];    /*!< Publish configuration for events                                          */
  __IM  uint32_t  RESERVED3[74];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED4[61];
  __IM  uint32_t  STATUS;                       /*!< Status                                                                    */
  __IM  uint32_t  RESERVED5[63];
  __IOM uint32_t  ENABLE;                       /*!< Enable or disable ADC                                                     */
  __IM  uint32_t  RESERVED6[3];
  __IOM SAADC_CH_Type CH[8];                    /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED7[24];
  __IOM uint32_t  RESOLUTION;                   /*!< Resolution configuration                                                  */
  __IOM uint32_t  OVERSAMPLE;                   /*!< Oversampling configuration. OVERSAMPLE should not be combined
                                                     with SCAN. The RESOLUTION is applied before averaging,
                                                     thus for high OVERSAMPLE a higher RESOLUTION should be
                                                     used.                                                                     */
  __IOM uint32_t  SAMPLERATE;                   /*!< Controls normal or continuous sample rate                                 */
  __IM  uint32_t  RESERVED8[12];
  __IOM SAADC_RESULT_Type RESULT;               /*!< RESULT EasyDMA channel                                                    */
} NRF_SAADC_Type;                               /*!< Size = 1592 (0x638)                                                       */



/* =========================================================================================================================== */
/* ================                                         TIMER0_NS                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Timer/Counter 0 (TIMER0_NS)
  */

