NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< TIMER0_NS Structure                                                       */
  __OM  uint32_t  TASKS_START;                  /*!< Start Timer                                                               */
  __OM  uint32_t  TASKS_STOP;                   /*!< Stop Timer                                                                */
  __OM  uint32_t  TASKS_COUNT;                  /*!< Increment Timer (Counter mode only)                                       */
  __OM  uint32_t  TASKS_CLEAR;                  /*!< Clear time                                                                */
  __OM  uint32_t  TASKS_SHUTDOWN;               /*!< Deprecated register - Shut down timer                                     */
  __IM  uint32_t  RESERVED[11];
  __OM  uint32_t  TASKS_CAPTURE[6];             /*!< Description collection: Capture Timer value to CC[n] register             */
  __IM  uint32_t  RESERVED1[10];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IOM uint32_t  SUBSCRIBE_COUNT;              /*!< Subscribe configuration for task COUNT                                    */
  __IOM uint32_t  SUBSCRIBE_CLEAR;              /*!< Subscribe configuration for task CLEAR                                    */
  __IOM uint32_t  SUBSCRIBE_SHUTDOWN;           /*!< Deprecated register - Subscribe configuration for task SHUTDOWN           */
  __IM  uint32_t  RESERVED2[11];
  __IOM uint32_t  SUBSCRIBE_CAPTURE[6];         /*!< Description collection: Subscribe configuration for task CAPTURE[n]       */
  __IM  uint32_t  RESERVED3[26];
  __IOM uint32_t  EVENTS_COMPARE[6];            /*!< Description collection: Compare event on CC[n] match                      */
  __IM  uint32_t  RESERVED4[26];
  __IOM uint32_t  PUBLISH_COMPARE[6];           /*!< Description collection: Publish configuration for event COMPARE[n]        */
  __IM  uint32_t  RESERVED5[10];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED6[64];
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED7[126];
  __IOM uint32_t  MODE;                         /*!< Timer mode selection                                                      */
  __IOM uint32_t  BITMODE;                      /*!< Configure the number of bits used by the TIMER                            */
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  PRESCALER;                    /*!< Timer prescaler register                                                  */
  __IOM uint32_t  ONESHOTEN[6];                 /*!< Description collection: Enable one-shot operation for Capture/Compare
                                                     channel n                                                                 */
  __IM  uint32_t  RESERVED9[5];
  __IOM uint32_t  CC[6];                        /*!< Description collection: Capture/Compare register n                        */
} NRF_TIMER_Type;                               /*!< Size = 1368 (0x558)                                                       */



/* =========================================================================================================================== */
/* ================                                          RTC0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time counter 0 (RTC0_NS)
  */

typedef struct {                                /*!< RTC0_NS Structure                                                         */
  __OM  uint32_t  TASKS_START;                  /*!< Start RTC counter                                                         */
  __OM  uint32_t  TASKS_STOP;                   /*!< Stop RTC counter                                                          */
  __OM  uint32_t  TASKS_CLEAR;                  /*!< Clear RTC counter                                                         */
  __OM  uint32_t  TASKS_TRIGOVRFLW;             /*!< Set counter to 0xFFFFF0                                                   */
  __IM  uint32_t  RESERVED[28];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IOM uint32_t  SUBSCRIBE_CLEAR;              /*!< Subscribe configuration for task CLEAR                                    */
  __IOM uint32_t  SUBSCRIBE_TRIGOVRFLW;         /*!< Subscribe configuration for task TRIGOVRFLW                               */
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  EVENTS_TICK;                  /*!< Event on counter increment                                                */
  __IOM uint32_t  EVENTS_OVRFLW;                /*!< Event on counter overflow                                                 */
  __IM  uint32_t  RESERVED2[14];
  __IOM uint32_t  EVENTS_COMPARE[4];            /*!< Description collection: Compare event on CC[n] match                      */
  __IM  uint32_t  RESERVED3[12];
  __IOM uint32_t  PUBLISH_TICK;                 /*!< Publish configuration for event TICK                                      */
  __IOM uint32_t  PUBLISH_OVRFLW;               /*!< Publish configuration for event OVRFLW                                    */
  __IM  uint32_t  RESERVED4[14];
  __IOM uint32_t  PUBLISH_COMPARE[4];           /*!< Description collection: Publish configuration for event COMPARE[n]        */
  __IM  uint32_t  RESERVED5[77];
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED6[13];
  __IOM uint32_t  EVTEN;                        /*!< Enable or disable event routing                                           */
  __IOM uint32_t  EVTENSET;                     /*!< Enable event routing                                                      */
  __IOM uint32_t  EVTENCLR;                     /*!< Disable event routing                                                     */
  __IM  uint32_t  RESERVED7[110];
  __IM  uint32_t  COUNTER;                      /*!< Current counter value                                                     */
  __IOM uint32_t  PRESCALER;                    /*!< 12-bit prescaler for counter frequency (32768/(PRESCALER+1)).
                                                     Must be written when RTC is stopped.                                      */
  __IM  uint32_t  RESERVED8[13];
  __IOM uint32_t  CC[4];                        /*!< Description collection: Compare register n                                */
} NRF_RTC_Type;                                 /*!< Size = 1360 (0x550)                                                       */



/* =========================================================================================================================== */
/* ================                                         DPPIC_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Distributed programmable peripheral interconnect controller 0 (DPPIC_NS)
  */

typedef struct {                                /*!< DPPIC_NS Structure                                                        */
  __OM  DPPIC_TASKS_CHG_Type TASKS_CHG[6];      /*!< Channel group tasks                                                       */
  __IM  uint32_t  RESERVED[20];
  __IOM DPPIC_SUBSCRIBE_CHG_Type SUBSCRIBE_CHG[6];/*!< Subscribe configuration for tasks                                       */
  __IM  uint32_t  RESERVED1[276];
  __IOM uint32_t  CHEN;                         /*!< Channel enable register                                                   */
  __IOM uint32_t  CHENSET;                      /*!< Channel enable set register                                               */
  __IOM uint32_t  CHENCLR;                      /*!< Channel enable clear register                                             */
  __IM  uint32_t  RESERVED2[189];
  __IOM uint32_t  CHG[6];                       /*!< Description collection: Channel group n Note: Writes to this
                                                     register are ignored if either SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DI
                                                     is enabled                                                                */
} NRF_DPPIC_Type;                               /*!< Size = 2072 (0x818)                                                       */



/* =========================================================================================================================== */
/* ================                                          WDT_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog Timer 0 (WDT_NS)
  */

typedef struct {                                /*!< WDT_NS Structure                                                          */
  __OM  uint32_t  TASKS_START;                  /*!< Start the watchdog                                                        */
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IM  uint32_t  RESERVED1[31];
  __IOM uint32_t  EVENTS_TIMEOUT;               /*!< Watchdog timeout                                                          */
  __IM  uint32_t  RESERVED2[31];
  __IOM uint32_t  PUBLISH_TIMEOUT;              /*!< Publish configuration for event TIMEOUT                                   */
  __IM  uint32_t  RESERVED3[96];
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED4[61];
  __IM  uint32_t  RUNSTATUS;                    /*!< Run status                                                                */
  __IM  uint32_t  REQSTATUS;                    /*!< Request status                                                            */
  __IM  uint32_t  RESERVED5[63];
  __IOM uint32_t  CRV;                          /*!< Counter reload value                                                      */
  __IOM uint32_t  RREN;                         /*!< Enable register for reload request registers                              */
  __IOM uint32_t  CONFIG;                       /*!< Configuration register                                                    */
  __IM  uint32_t  RESERVED6[60];
  __OM  uint32_t  RR[8];                        /*!< Description collection: Reload request n                                  */
} NRF_WDT_Type;                                 /*!< Size = 1568 (0x620)                                                       */



/* =========================================================================================================================== */
/* ================                                          EGU0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Event generator unit 0 (EGU0_NS)
  */

