NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< EGU0_NS Structure                                                         */
  __OM  uint32_t  TASKS_TRIGGER[16];            /*!< Description collection: Trigger n for triggering the corresponding
                                                     TRIGGERED[n] event                                                        */
  __IM  uint32_t  RESERVED[16];
  __IOM uint32_t  SUBSCRIBE_TRIGGER[16];        /*!< Description collection: Subscribe configuration for task TRIGGER[n]       */
  __IM  uint32_t  RESERVED1[16];
  __IOM uint32_t  EVENTS_TRIGGERED[16];         /*!< Description collection: Event number n generated by triggering
                                                     the corresponding TRIGGER[n] task                                         */
  __IM  uint32_t  RESERVED2[16];
  __IOM uint32_t  PUBLISH_TRIGGERED[16];        /*!< Description collection: Publish configuration for event TRIGGERED[n]      */
  __IM  uint32_t  RESERVED3[80];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
} NRF_EGU_Type;                                 /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                          PWM0_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Pulse width modulation unit 0 (PWM0_NS)
  */

typedef struct {                                /*!< PWM0_NS Structure                                                         */
  __IM  uint32_t  RESERVED;
  __OM  uint32_t  TASKS_STOP;                   /*!< Stops PWM pulse generation on all channels at the end of current
                                                     PWM period, and stops sequence playback                                   */
  __OM  uint32_t  TASKS_SEQSTART[2];            /*!< Description collection: Loads the first PWM value on all enabled
                                                     channels from sequence n, and starts playing that sequence
                                                     at the rate defined in SEQ[n]REFRESH and/or DECODER.MODE.
                                                     Causes PWM generation to start if not running.                            */
  __OM  uint32_t  TASKS_NEXTSTEP;               /*!< Steps by one value in the current sequence on all enabled channels
                                                     if DECODER.MODE=NextStep. Does not cause PWM generation
                                                     to start if not running.                                                  */
  __IM  uint32_t  RESERVED1[28];
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IOM uint32_t  SUBSCRIBE_SEQSTART[2];        /*!< Description collection: Subscribe configuration for task SEQSTART[n]      */
  __IOM uint32_t  SUBSCRIBE_NEXTSTEP;           /*!< Subscribe configuration for task NEXTSTEP                                 */
  __IM  uint32_t  RESERVED2[28];
  __IOM uint32_t  EVENTS_STOPPED;               /*!< Response to STOP task, emitted when PWM pulses are no longer
                                                     generated                                                                 */
  __IOM uint32_t  EVENTS_SEQSTARTED[2];         /*!< Description collection: First PWM period started on sequence
                                                     n                                                                         */
  __IOM uint32_t  EVENTS_SEQEND[2];             /*!< Description collection: Emitted at end of every sequence n,
                                                     when last value from RAM has been applied to wave counter                 */
  __IOM uint32_t  EVENTS_PWMPERIODEND;          /*!< Emitted at the end of each PWM period                                     */
  __IOM uint32_t  EVENTS_LOOPSDONE;             /*!< Concatenated sequences have been played the amount of times
                                                     defined in LOOP.CNT                                                       */
  __IM  uint32_t  RESERVED3[25];
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IOM uint32_t  PUBLISH_SEQSTARTED[2];        /*!< Description collection: Publish configuration for event SEQSTARTED[n]     */
  __IOM uint32_t  PUBLISH_SEQEND[2];            /*!< Description collection: Publish configuration for event SEQEND[n]         */
  __IOM uint32_t  PUBLISH_PWMPERIODEND;         /*!< Publish configuration for event PWMPERIODEND                              */
  __IOM uint32_t  PUBLISH_LOOPSDONE;            /*!< Publish configuration for event LOOPSDONE                                 */
  __IM  uint32_t  RESERVED4[24];
  __IOM uint32_t  SHORTS;                       /*!< Shortcuts between local events and tasks                                  */
  __IM  uint32_t  RESERVED5[63];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED6[125];
  __IOM uint32_t  ENABLE;                       /*!< PWM module enable register                                                */
  __IOM uint32_t  MODE;                         /*!< Selects operating mode of the wave counter                                */
  __IOM uint32_t  COUNTERTOP;                   /*!< Value up to which the pulse generator counter counts                      */
  __IOM uint32_t  PRESCALER;                    /*!< Configuration for PWM_CLK                                                 */
  __IOM uint32_t  DECODER;                      /*!< Configuration of the decoder                                              */
  __IOM uint32_t  LOOP;                         /*!< Number of playbacks of a loop                                             */
  __IM  uint32_t  RESERVED7[2];
  __IOM PWM_SEQ_Type SEQ[2];                    /*!< Unspecified                                                               */
  __IOM PWM_PSEL_Type PSEL;                     /*!< Unspecified                                                               */
} NRF_PWM_Type;                                 /*!< Size = 1392 (0x570)                                                       */



/* =========================================================================================================================== */
/* ================                                          PDM_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Pulse Density Modulation (Digital Microphone) Interface 0 (PDM_NS)
  */

