NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< PDM_NS Structure                                                          */
  __OM  uint32_t  TASKS_START;                  /*!< Starts continuous PDM transfer                                            */
  __OM  uint32_t  TASKS_STOP;                   /*!< Stops PDM transfer                                                        */
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IM  uint32_t  RESERVED1[30];
  __IOM uint32_t  EVENTS_STARTED;               /*!< PDM transfer has started                                                  */
  __IOM uint32_t  EVENTS_STOPPED;               /*!< PDM transfer has finished                                                 */
  __IOM uint32_t  EVENTS_END;                   /*!< The PDM has written the last sample specified by SAMPLE.MAXCNT
                                                     (or the last sample after a STOP task has been received)
                                                     to Data RAM                                                               */
  __IM  uint32_t  RESERVED2[29];
  __IOM uint32_t  PUBLISH_STARTED;              /*!< Publish configuration for event STARTED                                   */
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IOM uint32_t  PUBLISH_END;                  /*!< Publish configuration for event END                                       */
  __IM  uint32_t  RESERVED3[93];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED4[125];
  __IOM uint32_t  ENABLE;                       /*!< PDM module enable register                                                */
  __IOM uint32_t  PDMCLKCTRL;                   /*!< PDM clock generator control                                               */
  __IOM uint32_t  MODE;                         /*!< Defines the routing of the connected PDM microphones' signals             */
  __IM  uint32_t  RESERVED5[3];
  __IOM uint32_t  GAINL;                        /*!< Left output gain adjustment                                               */
  __IOM uint32_t  GAINR;                        /*!< Right output gain adjustment                                              */
  __IOM uint32_t  RATIO;                        /*!< Selects the ratio between PDM_CLK and output sample rate. Change
                                                     PDMCLKCTRL accordingly.                                                   */
  __IM  uint32_t  RESERVED6[7];
  __IOM PDM_PSEL_Type PSEL;                     /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED7[6];
  __IOM PDM_SAMPLE_Type SAMPLE;                 /*!< Unspecified                                                               */
} NRF_PDM_Type;                                 /*!< Size = 1384 (0x568)                                                       */



/* =========================================================================================================================== */
/* ================                                          I2S_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-IC Sound 0 (I2S_NS)
  */

typedef struct {                                /*!< I2S_NS Structure                                                          */
  __OM  uint32_t  TASKS_START;                  /*!< Starts continuous I2S transfer. Also starts MCK generator when
                                                     this is enabled.                                                          */
  __OM  uint32_t  TASKS_STOP;                   /*!< Stops I2S transfer. Also stops MCK generator. Triggering this
                                                     task will cause the STOPPED event to be generated.                        */
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  SUBSCRIBE_START;              /*!< Subscribe configuration for task START                                    */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< Subscribe configuration for task STOP                                     */
  __IM  uint32_t  RESERVED1[31];
  __IOM uint32_t  EVENTS_RXPTRUPD;              /*!< The RXD.PTR register has been copied to internal double-buffers.
                                                     When the I2S module is started and RX is enabled, this
                                                     event will be generated for every RXTXD.MAXCNT words that
                                                     are received on the SDIN pin.                                             */
  __IOM uint32_t  EVENTS_STOPPED;               /*!< I2S transfer stopped.                                                     */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  EVENTS_TXPTRUPD;              /*!< The TDX.PTR register has been copied to internal double-buffers.
                                                     When the I2S module is started and TX is enabled, this
                                                     event will be generated for every RXTXD.MAXCNT words that
                                                     are sent on the SDOUT pin.                                                */
  __IM  uint32_t  RESERVED3[27];
  __IOM uint32_t  PUBLISH_RXPTRUPD;             /*!< Publish configuration for event RXPTRUPD                                  */
  __IOM uint32_t  PUBLISH_STOPPED;              /*!< Publish configuration for event STOPPED                                   */
  __IM  uint32_t  RESERVED4[2];
  __IOM uint32_t  PUBLISH_TXPTRUPD;             /*!< Publish configuration for event TXPTRUPD                                  */
  __IM  uint32_t  RESERVED5[90];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  RESERVED6[125];
  __IOM uint32_t  ENABLE;                       /*!< Enable I2S module.                                                        */
  __IOM I2S_CONFIG_Type CONFIG;                 /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED7[3];
  __IOM I2S_RXD_Type RXD;                       /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED8;
  __IOM I2S_TXD_Type TXD;                       /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED9[3];
  __IOM I2S_RXTXD_Type RXTXD;                   /*!< Unspecified                                                               */
  __IM  uint32_t  RESERVED10[3];
  __IOM I2S_PSEL_Type PSEL;                     /*!< Unspecified                                                               */
} NRF_I2S_Type;                                 /*!< Size = 1396 (0x574)                                                       */



/* =========================================================================================================================== */
/* ================                                          IPC_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Interprocessor communication 0 (IPC_NS)
  */

typedef struct {                                /*!< IPC_NS Structure                                                          */
  __OM  uint32_t  TASKS_SEND[8];                /*!< Description collection: Trigger events on IPC channel enabled
                                                     in SEND_CNF[n]                                                            */
  __IM  uint32_t  RESERVED[24];
  __IOM uint32_t  SUBSCRIBE_SEND[8];            /*!< Description collection: Subscribe configuration for task SEND[n]          */
  __IM  uint32_t  RESERVED1[24];
  __IOM uint32_t  EVENTS_RECEIVE[8];            /*!< Description collection: Event received on one or more of the
                                                     enabled IPC channels in RECEIVE_CNF[n]                                    */
  __IM  uint32_t  RESERVED2[24];
  __IOM uint32_t  PUBLISH_RECEIVE[8];           /*!< Description collection: Publish configuration for event RECEIVE[n]        */
  __IM  uint32_t  RESERVED3[88];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  INTPEND;                      /*!< Pending interrupts                                                        */
  __IM  uint32_t  RESERVED4[128];
  __IOM uint32_t  SEND_CNF[8];                  /*!< Description collection: Send event configuration for TASKS_SEND[n]        */
  __IM  uint32_t  RESERVED5[24];
  __IOM uint32_t  RECEIVE_CNF[8];               /*!< Description collection: Receive event configuration for EVENTS_RECEIVE[n] */
  __IM  uint32_t  RESERVED6[24];
  __IOM uint32_t  GPMEM[4];                     /*!< Description collection: General purpose memory                            */
} NRF_IPC_Type;                                 /*!< Size = 1568 (0x620)                                                       */



/* =========================================================================================================================== */
/* ================                                          FPU_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief FPU (FPU_NS)
  */

