NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< FPU_NS Structure                                                          */
  __IM  uint32_t  UNUSED;                       /*!< Unused.                                                                   */
} NRF_FPU_Type;                                 /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                       APPROTECT_NS                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Access Port Protection 0 (APPROTECT_NS)
  */

typedef struct {                                /*!< APPROTECT_NS Structure                                                    */
  __IM  uint32_t  RESERVED[896];
  __IOM APPROTECT_SECUREAPPROTECT_Type SECUREAPPROTECT;/*!< Unspecified                                                        */
  __IM  uint32_t  RESERVED1[3];
  __IOM APPROTECT_APPROTECT_Type APPROTECT;     /*!< Unspecified                                                               */
} NRF_APPROTECT_Type;                           /*!< Size = 3604 (0xe14)                                                       */



/* =========================================================================================================================== */
/* ================                                          KMU_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Key management unit 0 (KMU_NS)
  */

typedef struct {                                /*!< KMU_NS Structure                                                          */
  __OM  uint32_t  TASKS_PUSH_KEYSLOT;           /*!< Push a key slot over secure APB                                           */
  __IM  uint32_t  RESERVED[63];
  __IOM uint32_t  EVENTS_KEYSLOT_PUSHED;        /*!< Key slot successfully pushed over secure APB                              */
  __IOM uint32_t  EVENTS_KEYSLOT_REVOKED;       /*!< Key slot has been revoked and cannot be tasked for selection              */
  __IOM uint32_t  EVENTS_KEYSLOT_ERROR;         /*!< No key slot selected, no destination address defined, or error
                                                     during push operation                                                     */
  __IM  uint32_t  RESERVED1[125];
  __IOM uint32_t  INTEN;                        /*!< Enable or disable interrupt                                               */
  __IOM uint32_t  INTENSET;                     /*!< Enable interrupt                                                          */
  __IOM uint32_t  INTENCLR;                     /*!< Disable interrupt                                                         */
  __IM  uint32_t  INTPEND;                      /*!< Pending interrupts                                                        */
  __IM  uint32_t  RESERVED2[63];
  __IM  uint32_t  STATUS;                       /*!< Status bits for KMU operation                                             */
  __IM  uint32_t  RESERVED3[60];
  __IOM uint32_t  SELECTKEYSLOT;                /*!< Select key slot to be read over AHB or pushed over secure APB
                                                     when TASKS_PUSH_KEYSLOT is started                                        */
} NRF_KMU_Type;                                 /*!< Size = 1284 (0x504)                                                       */



/* =========================================================================================================================== */
/* ================                                          NVMC_NS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Non-volatile memory controller 0 (NVMC_NS)
  */

typedef struct {                                /*!< NVMC_NS Structure                                                         */
  __IM  uint32_t  RESERVED[256];
  __IM  uint32_t  READY;                        /*!< Ready flag                                                                */
  __IM  uint32_t  RESERVED1;
  __IM  uint32_t  READYNEXT;                    /*!< Ready flag                                                                */
  __IM  uint32_t  RESERVED2[62];
  __IOM uint32_t  CONFIG;                       /*!< Configuration register                                                    */
  __IM  uint32_t  RESERVED3;
  __OM  uint32_t  ERASEALL;                     /*!< Register for erasing all non-volatile user memory                         */
  __IM  uint32_t  RESERVED4[3];
  __IOM uint32_t  ERASEPAGEPARTIALCFG;          /*!< Register for partial erase configuration                                  */
  __IM  uint32_t  RESERVED5[8];
  __IOM uint32_t  ICACHECNF;                    /*!< I-code cache configuration register                                       */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  IHIT;                         /*!< I-code cache hit counter                                                  */
  __IOM uint32_t  IMISS;                        /*!< I-code cache miss counter                                                 */
  __IM  uint32_t  RESERVED7[13];
  __IOM uint32_t  CONFIGNS;                     /*!< Unspecified                                                               */
  __OM  uint32_t  WRITEUICRNS;                  /*!< Non-secure APPROTECT enable register                                      */
} NRF_NVMC_Type;                                /*!< Size = 1420 (0x58c)                                                       */



/* =========================================================================================================================== */
/* ================                                          VMC_NS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Volatile Memory controller 0 (VMC_NS)
  */

typedef struct {                                /*!< VMC_NS Structure                                                          */
  __IM  uint32_t  RESERVED[384];
  __IOM VMC_RAM_Type RAM[8];                    /*!< Unspecified                                                               */
} NRF_VMC_Type;                                 /*!< Size = 1664 (0x680)                                                       */



/* =========================================================================================================================== */
/* ================                                       CRYPTOCELL_S                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL register interface (CRYPTOCELL_S)
  */

typedef struct {                                /*!< CRYPTOCELL_S Structure                                                    */
  __IM  uint32_t  RESERVED[320];
  __IOM uint32_t  ENABLE;                       /*!< Enable CRYPTOCELL subsystem.                                              */
} NRF_CRYPTOCELL_Type;                          /*!< Size = 1284 (0x504)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_AES_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL AES engine (CC_AES_S)
  */

typedef struct {                                /*!< CC_AES_S Structure                                                        */
  __IM  uint32_t  RESERVED[256];
  __OM  uint32_t  AES_KEY_0[8];                 /*!< Description collection: AES key value to use. The initial AES_KEY_0[0]
                                                     register holds the least significant bits [31:0] of the
                                                     key value.                                                                */
  __IM  uint32_t  RESERVED1[8];
  __IOM uint32_t  AES_IV_0[4];                  /*!< Description collection: AES Initialization Vector (IV) to use.
                                                     The initial AES_IV_0[0] register holds the least significant
                                                     bits [31:0] of the IV.                                                    */
  __IM  uint32_t  RESERVED2[4];
  __IOM uint32_t  AES_CTR[4];                   /*!< Description collection: AES counter (CTR) to use. The initial
                                                     AES_CTR[0] register holds the least significant bits [31:0]
                                                     of the CTR.                                                               */
  __IM  uint32_t  AES_BUSY;                     /*!< Status register for AES engine activity.                                  */
  __IM  uint32_t  RESERVED3;
  __OM  uint32_t  AES_SK;                       /*!< Writing to this address trigger sampling of the HW key to the
                                                     AES_KEY_0 register                                                        */
  __OM  uint32_t  AES_CMAC_INIT;                /*!< Writing to this address triggers the AES engine to generate
                                                     K1 and K2 for AES-CMAC operations.                                        */
  __IM  uint32_t  RESERVED4[15];
  __IOM uint32_t  AES_REMAINING_BYTES;          /*!< This register should be set with the amount of remaining bytes
                                                     until the end of the current AES operation.                               */
  __IOM uint32_t  AES_CONTROL;                  /*!< Control the AES engine behavior.                                          */
  __IM  uint32_t  RESERVED5;
  __IM  uint32_t  AES_HW_FLAGS;                 /*!< Hardware configuration of the AES engine. Reset value holds
                                                     the supported features.                                                   */
  __IM  uint32_t  RESERVED6[3];
  __IOM uint32_t  AES_CTR_NO_INCREMENT;         /*!< This register enables the AES CTR no increment mode in which
                                                     the counter mode is not incremented between two blocks                    */
  __IM  uint32_t  RESERVED7[6];
  __OM  uint32_t  AES_SW_RESET;                 /*!< Reset the AES engine.                                                     */
  __IM  uint32_t  RESERVED8[11];
  __OM  uint32_t  AES_CMAC_SIZE0_KICK;          /*!< Writing to this address triggers the AES engine to perform a
                                                     CMAC operation with size 0. The CMAC result can be read
                                                     from the AES_IV_0 register.                                               */
} NRF_CC_AES_Type;                              /*!< Size = 1320 (0x528)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_AHB_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL AHB interface (CC_AHB_S)
  */

typedef struct {                                /*!< CC_AHB_S Structure                                                        */
  __IM  uint32_t  RESERVED[704];
  __IOM uint32_t  AHBM_SINGLES;                 /*!< This register forces the AHB transactions from CRYPTOCELL master
                                                     to be always singles.                                                     */
  __IOM uint32_t  AHBM_HPROT;                   /*!< This register holds the AHB HPROT value                                   */
  __IOM uint32_t  AHBM_HMASTLOCK;               /*!< This register holds AHB HMASTLOCK value                                   */
  __IOM uint32_t  AHBM_HNONSEC;                 /*!< This register holds AHB HNONSEC value                                     */
} NRF_CC_AHB_Type;                              /*!< Size = 2832 (0xb10)                                                       */



/* =========================================================================================================================== */
/* ================                                        CC_CHACHA_S                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL CHACHA engine (CC_CHACHA_S)
  */

typedef struct {                                /*!< CC_CHACHA_S Structure                                                     */
  __IM  uint32_t  RESERVED[224];
  __IOM uint32_t  CHACHA_CONTROL;               /*!< Control the CHACHA engine behavior.                                       */
  __IM  uint32_t  CHACHA_VERSION;               /*!< CHACHA engine HW version                                                  */
  __OM  uint32_t  CHACHA_KEY[8];                /*!< Description collection: CHACHA key value to use. The initial
                                                     CHACHA_KEY[0] register holds the least significant bits
                                                     [31:0] of the key value.                                                  */
  __IOM uint32_t  CHACHA_IV[2];                 /*!< Description collection: CHACHA Initialization Vector (IV) to
                                                     use. The IV is also known as the nonce.                                   */
  __IM  uint32_t  CHACHA_BUSY;                  /*!< Status register for CHACHA engine activity.                               */
  __IM  uint32_t  CHACHA_HW_FLAGS;              /*!< Hardware configuration of the CHACHA engine. Reset value holds
                                                     the supported features.                                                   */
  __IOM uint32_t  CHACHA_BLOCK_CNT_LSB;         /*!< Store the LSB value of the block counter, in order to support
                                                     suspend/resume of operation                                               */
  __IOM uint32_t  CHACHA_BLOCK_CNT_MSB;         /*!< Store the MSB value of the block counter, in order to support
                                                     suspend/resume of operation                                               */
  __OM  uint32_t  CHACHA_SW_RESET;              /*!< Reset the CHACHA engine.                                                  */
  __IM  uint32_t  CHACHA_POLY1305_KEY[8];       /*!< Description collection: The auto-generated key to use in Poly1305
                                                     MAC calculation. The initial CHACHA_POLY1305_KEY[0] register
                                                     holds the least significant bits [31:0] of the key value.                 */
  __IOM uint32_t  CHACHA_ENDIANNESS;            /*!< CHACHA engine data order configuration.                                   */
  __IM  uint32_t  CHACHA_DEBUG;                 /*!< Debug register for the CHACHA engine                                      */
} NRF_CC_CHACHA_Type;                           /*!< Size = 1004 (0x3ec)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_CTL_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL CTL interface (CC_CTL_S)
  */

typedef struct {                                /*!< CC_CTL_S Structure                                                        */
  __IM  uint32_t  RESERVED[576];
  __OM  uint32_t  CRYPTO_CTL;                   /*!< Defines the cryptographic flow.                                           */
  __IM  uint32_t  RESERVED1[3];
  __IM  uint32_t  CRYPTO_BUSY;                  /*!< Status register for cryptographic cores engine activity.                  */
  __IM  uint32_t  RESERVED2[2];
  __IM  uint32_t  HASH_BUSY;                    /*!< Status register for HASH engine activity.                                 */
  __IM  uint32_t  RESERVED3[4];
  __IOM uint32_t  CONTEXT_ID;                   /*!< A general-purpose read/write register.                                    */
} NRF_CC_CTL_Type;                              /*!< Size = 2356 (0x934)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_DIN_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL Data IN interface (CC_DIN_S)
  */

