NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< CC_DIN_S Structure                                                        */
  __IM  uint32_t  RESERVED[768];
  __OM  uint32_t  DIN_BUFFER;                   /*!< Used by CPU to write data directly to the DIN buffer, which
                                                     is then sent to the cryptographic engines for processing.                 */
  __IM  uint32_t  RESERVED1[7];
  __IM  uint32_t  DIN_DMA_MEM_BUSY;             /*!< Status register for DIN DMA engine activity when accessing memory.        */
  __IM  uint32_t  RESERVED2;
  __OM  uint32_t  SRC_MEM_ADDR;                 /*!< Data source address in memory.                                            */
  __OM  uint32_t  SRC_MEM_SIZE;                 /*!< The number of bytes to be read from memory. Writing to this
                                                     register triggers the DMA operation.                                      */
  __IOM uint32_t  SRC_SRAM_ADDR;                /*!< Data source address in RNG SRAM.                                          */
  __OM  uint32_t  SRC_SRAM_SIZE;                /*!< The number of bytes to be read from RNG SRAM. Writing to this
                                                     register triggers the DMA operation.                                      */
  __IM  uint32_t  DIN_DMA_SRAM_BUSY;            /*!< Status register for DIN DMA engine activity when accessing RNG
                                                     SRAM.                                                                     */
  __IOM uint32_t  DIN_DMA_SRAM_ENDIANNESS;      /*!< Configure the endianness of DIN DMA transactions towards RNG
                                                     SRAM.                                                                     */
  __IM  uint32_t  RESERVED3;
  __OM  uint32_t  DIN_SW_RESET;                 /*!< Reset the DIN DMA engine.                                                 */
  __OM  uint32_t  DIN_CPU_DATA;                 /*!< Specifies the number of bytes the CPU will write to the DIN_BUFFER,
                                                     ensuring the cryptographic engine processes the correct
                                                     amount of data.                                                           */
  __OM  uint32_t  DIN_WRITE_ALIGN;              /*!< Indicates that the next CPU write to the DIN_BUFFER is the last
                                                     in the sequence. This is needed only when the data size
                                                     is NOT modulo 4 (e.g. HASH padding).                                      */
  __IM  uint32_t  DIN_FIFO_EMPTY;               /*!< Register indicating if DIN FIFO is empty and if more data can
                                                     be accepted.                                                              */
  __IM  uint32_t  RESERVED4;
  __OM  uint32_t  DIN_FIFO_RESET;               /*!< Reset the DIN FIFO, effectively clearing the FIFO for new data.           */
} NRF_CC_DIN_Type;                              /*!< Size = 3164 (0xc5c)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_DOUT_S                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL Data OUT interface (CC_DOUT_S)
  */

typedef struct {                                /*!< CC_DOUT_S Structure                                                       */
  __IM  uint32_t  RESERVED[768];
  __IM  uint32_t  DOUT_BUFFER;                  /*!< Cryptographic results directly accessible by the CPU.                     */
  __IM  uint32_t  RESERVED1[71];
  __IM  uint32_t  DOUT_DMA_MEM_BUSY;            /*!< Status register for DOUT DMA engine activity when accessing
                                                     memory.                                                                   */
  __IM  uint32_t  RESERVED2;
  __OM  uint32_t  DST_MEM_ADDR;                 /*!< Data destination address in memory.                                       */
  __OM  uint32_t  DST_MEM_SIZE;                 /*!< The number of bytes to be written to memory.                              */
  __IOM uint32_t  DST_SRAM_ADDR;                /*!< Data destination address in RNG SRAM.                                     */
  __OM  uint32_t  DST_SRAM_SIZE;                /*!< The number of bytes to be written to RNG SRAM.                            */
  __IM  uint32_t  DOUT_DMA_SRAM_BUSY;           /*!< Status register for DOUT DMA engine activity when accessing
                                                     RNG SRAM.                                                                 */
  __IOM uint32_t  DOUT_DMA_SRAM_ENDIANNESS;     /*!< Configure the endianness of DOUT DMA transactions towards RNG
                                                     SRAM.                                                                     */
  __IM  uint32_t  RESERVED3;
  __OM  uint32_t  DOUT_READ_ALIGN;              /*!< Indication that the next CPU read from the DOUT_BUFFER is the
                                                     last in the sequence. This is needed only when the data
                                                     size is NOT modulo 4 (e.g. HASH padding).                                 */
  __IM  uint32_t  RESERVED4[2];
  __IM  uint32_t  DOUT_FIFO_EMPTY;              /*!< Register indicating if DOUT FIFO is empty or if more data will
                                                     come.                                                                     */
  __IM  uint32_t  RESERVED5;
  __OM  uint32_t  DOUT_SW_RESET;                /*!< Reset the DOUT DMA engine.                                                */
} NRF_CC_DOUT_Type;                             /*!< Size = 3420 (0xd5c)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_HASH_S                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL HASH engine (CC_HASH_S)
  */

typedef struct {                                /*!< CC_HASH_S Structure                                                       */
  __IM  uint32_t  RESERVED[400];
  __IOM uint32_t  HASH_H[8];                    /*!< Description collection: HASH_H value registers. The initial
                                                     HASH_H[0] register holds the least significant bits [31:0]
                                                     of the value.                                                             */
  __IM  uint32_t  RESERVED1[9];
  __OM  uint32_t  HASH_PAD_AUTO;                /*!< Configure the HASH engine to automatically pad data at the end
                                                     of the DMA transfer to complete the digest operation.                     */
  __IM  uint32_t  RESERVED2[3];
  __OM  uint32_t  HASH_INIT_STATE;              /*!< Configure HASH engine initial state registers.                            */
  __IM  uint32_t  RESERVED3[70];
  __IM  uint32_t  HASH_VERSION;                 /*!< HASH engine HW version                                                    */
  __IM  uint32_t  RESERVED4[3];
  __IOM uint32_t  HASH_CONTROL;                 /*!< Control the HASH engine behavior.                                         */
  __IOM uint32_t  HASH_PAD;                     /*!< Enable the hardware padding feature of the HASH engine.                   */
  __IOM uint32_t  HASH_PAD_FORCE;               /*!< Force the hardware padding operation to trigger if the input
                                                     data length is zero bytes.                                                */
  __IOM uint32_t  HASH_CUR_LEN_0;               /*!< Bits [31:0] of the number of bytes that have been digested so
                                                     far.                                                                      */
  __IOM uint32_t  HASH_CUR_LEN_1;               /*!< Bits [63:32] of the number of bytes that have been digested
                                                     so far.                                                                   */
  __IM  uint32_t  RESERVED5[2];
  __IM  uint32_t  HASH_HW_FLAGS;                /*!< Hardware configuration of the HASH engine. Reset value holds
                                                     the supported features.                                                   */
  __IM  uint32_t  RESERVED6;
  __OM  uint32_t  HASH_SW_RESET;                /*!< Reset the HASH engine.                                                    */
  __IOM uint32_t  HASH_ENDIANNESS;              /*!< Configure the endianness of HASH data and padding generation.             */
} NRF_CC_HASH_Type;                             /*!< Size = 2028 (0x7ec)                                                       */



/* =========================================================================================================================== */
/* ================                                       CC_HOST_RGF_S                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL HOST register interface (CC_HOST_RGF_S)
  */

typedef struct {                                /*!< CC_HOST_RGF_S Structure                                                   */
  __IM  uint32_t  RESERVED[640];
  __IM  uint32_t  IRR;                          /*!< Interrupt request register. Each bit of this register holds
                                                     the interrupt status of a single interrupt source. If corresponding
                                                     IMR bit is unmasked, an interrupt is generated.                           */
  __IOM uint32_t  IMR;                          /*!< Interrupt mask register. Each bit of this register holds the
                                                     mask of a single interrupt source.                                        */
  __OM  uint32_t  ICR;                          /*!< Interrupt clear register. Writing a 1 bit into a field in this
                                                     register will clear the corresponding bit in IRR.                         */
  __IOM uint32_t  ENDIANNESS;                   /*!< This register defines the endianness of the Host-accessible
                                                     registers, and can only be written once.                                  */
  __IM  uint32_t  RESERVED1[5];
  __IM  uint32_t  HOST_SIGNATURE;               /*!< This register holds the CRYPTOCELL subsystem signature. See
                                                     reset value.                                                              */
  __IM  uint32_t  HOST_BOOT;                    /*!< Hardware configuration of the CRYPTOCELL subsystem. Reset value
                                                     holds the supported features.                                             */
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  HOST_CRYPTOKEY_SEL;           /*!< AES hardware key select.                                                  */
  __IM  uint32_t  RESERVED3[4];
  __IOM uint32_t  HOST_IOT_KPRTL_LOCK;          /*!< This write-once register is the K_PRTL lock register. When this
                                                     register is set, K_PRTL cannot be used and a zeroed key
                                                     will be used instead. The value of this register is saved
                                                     in the CRYPTOCELL AO power domain.                                        */
  __IOM uint32_t  HOST_IOT_KDR0;                /*!< This register holds bits 31:0 of K_DR. The value of this register
                                                     is saved in the CRYPTOCELL AO power domain. Reading from
                                                     this address returns the K_DR valid status indicating if
                                                     K_DR is successfully retained.                                            */
  __OM  uint32_t  HOST_IOT_KDR1;                /*!< This register holds bits 63:32 of K_DR. The value of this register
                                                     is saved in the CRYPTOCELL AO power domain.                               */
  __OM  uint32_t  HOST_IOT_KDR2;                /*!< This register holds bits 95:64 of K_DR. The value of this register
                                                     is saved in the CRYPTOCELL AO power domain.                               */
  __OM  uint32_t  HOST_IOT_KDR3;                /*!< This register holds bits 127:96 of K_DR. The value of this register
                                                     is saved in the CRYPTOCELL AO power domain.                               */
  __IOM uint32_t  HOST_IOT_LCS;                 /*!< Controls life-cycle state (LCS) for CRYPTOCELL subsystem                  */
} NRF_CC_HOST_RGF_Type;                         /*!< Size = 2660 (0xa64)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_MISC_S                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL MISC interface (CC_MISC_S)
  */

typedef struct {                                /*!< CC_MISC_S Structure                                                       */
  __IM  uint32_t  RESERVED[516];
  __OM  uint32_t  AES_CLK;                      /*!< Clock control for the AES engine.                                         */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  HASH_CLK;                     /*!< Clock control for the HASH engine.                                        */
  __OM  uint32_t  PKA_CLK;                      /*!< Clock control for the PKA engine.                                         */
  __OM  uint32_t  DMA_CLK;                      /*!< Clock control for the DMA engines.                                        */
  __IM  uint32_t  CLK_STATUS;                   /*!< CRYPTOCELL clocks status register.                                        */
  __IM  uint32_t  RESERVED2[12];
  __OM  uint32_t  CHACHA_CLK;                   /*!< Clock control for the CHACHA engine.                                      */
} NRF_CC_MISC_Type;                             /*!< Size = 2140 (0x85c)                                                       */



/* =========================================================================================================================== */
/* ================                                         CC_PKA_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL PKA engine (CC_PKA_S)
  */

