NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120.h
typedef struct {                                /*!< CC_PKA_S Structure                                                        */
  __IOM uint32_t  MEMORY_MAP[32];               /*!< Description collection: Register for mapping the virtual register
                                                     R[n] to a physical address in the PKA SRAM.                               */
  __IOM uint32_t  OPCODE;                       /*!< Operation code to be executed by the PKA engine. Writing to
                                                     this register triggers the PKA operation.                                 */
  __IOM uint32_t  N_NP_T0_T1_ADDR;              /*!< This register defines the N, Np, T0, and T1 virtual register
                                                     index.                                                                    */
  __IM  uint32_t  PKA_STATUS;                   /*!< This register holds the status for the PKA pipeline.                      */
  __OM  uint32_t  PKA_SW_RESET;                 /*!< Reset the PKA engine.                                                     */
  __IOM uint32_t  PKA_L[8];                     /*!< Description collection: This register holds the operands bit
                                                     size.                                                                     */
  __IM  uint32_t  PKA_PIPE;                     /*!< Status register indicating if the PKA pipeline is ready to receive
                                                     a new OPCODE.                                                             */
  __IM  uint32_t  PKA_DONE;                     /*!< Status register indicating if the PKA operation has been completed.       */
  __IM  uint32_t  RESERVED[3];
  __IM  uint32_t  PKA_VERSION;                  /*!< PKA engine HW version. Reset value holds the version.                     */
  __IM  uint32_t  RESERVED1[3];
  __OM  uint32_t  PKA_SRAM_WADDR;               /*!< Start address in PKA SRAM for subsequent write transactions.              */
  __OM  uint32_t  PKA_SRAM_WDATA;               /*!< Write data to PKA SRAM. Writing to this register triggers a
                                                     DMA transaction writing data into PKA SRAM. The DMA address
                                                     offset is automatically incremented during write.                         */
  __IM  uint32_t  PKA_SRAM_RDATA;               /*!< Read data from PKA SRAM. Reading from this register triggers
                                                     a DMA transaction read data from PKA SRAM. The DMA address
                                                     offset is automatically incremented during read.                          */
  __OM  uint32_t  PKA_SRAM_WCLEAR;              /*!< Register for clearing PKA SRAM write buffer.                              */
  __OM  uint32_t  PKA_SRAM_RADDR;               /*!< Start address in PKA SRAM for subsequent read transactions.               */
} NRF_CC_PKA_Type;                              /*!< Size = 232 (0xe8)                                                         */



/* =========================================================================================================================== */
/* ================                                         CC_RNG_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL RNG engine (CC_RNG_S)
  */

typedef struct {                                /*!< CC_RNG_S Structure                                                        */
  __IM  uint32_t  RESERVED[64];
  __IOM uint32_t  RNG_IMR;                      /*!< Interrupt mask register. Each bit of this register holds the
                                                     mask of a single interrupt source.                                        */
  __IM  uint32_t  RNG_ISR;                      /*!< Interrupt status register. Each bit of this register holds the
                                                     interrupt status of a single interrupt source. If corresponding
                                                     RNG_IMR bit is unmasked, an interrupt is generated.                       */
  __OM  uint32_t  RNG_ICR;                      /*!< Interrupt clear register. Writing a 1 bit into a field in this
                                                     register will clear the corresponding bit in RNG_ISR.                     */
  __IOM uint32_t  TRNG_CONFIG;                  /*!< TRNG ring oscillator length configuration                                 */
  __IM  uint32_t  TRNG_VALID;                   /*!< This register indicates if TRNG entropy collection is valid.              */
  __IM  uint32_t  EHR_DATA[6];                  /*!< Description collection: The entropy holding registers (EHR)
                                                     hold 192-bits random data collected by the TRNG. The initial
                                                     EHR_DATA[0] register holds the least significant bits [31:0]
                                                     of the random data value.                                                 */
  __IOM uint32_t  NOISE_SOURCE;                 /*!< This register controls the ring oscillator circuit used as a
                                                     noise source.                                                             */
  __IOM uint32_t  SAMPLE_CNT;                   /*!< Sample count defining the number of CPU clock cycles between
                                                     two consecutive noise source samples.                                     */
  __IOM uint32_t  AUTOCORR_STATISTIC;           /*!< Statistics counter for autocorrelation test activations. Statistics
                                                     collection is stopped if one of the counters reach its
                                                     limit of all ones.                                                        */
  __IOM uint32_t  TRNG_DEBUG;                   /*!< Debug register for the TRNG. This register is used to bypass
                                                     TRNG tests in hardware.                                                   */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  RNG_SW_RESET;                 /*!< Reset the RNG engine.                                                     */
  __IM  uint32_t  RESERVED2[29];
  __IM  uint32_t  RNG_BUSY;                     /*!< Status register for RNG engine activity.                                  */
  __OM  uint32_t  TRNG_RESET;                   /*!< Reset the TRNG, including internal counter of collected bits
                                                     and registers EHR_DATA and TRNG_VALID.                                    */
  __IM  uint32_t  RNG_HW_FLAGS;                 /*!< Hardware configuration of RNG engine. Reset value holds the
                                                     supported features.                                                       */
  __OM  uint32_t  RNG_CLK;                      /*!< Control clock for the RNG engine.                                         */
  __IOM uint32_t  RNG_DMA;                      /*!< Writing to this register enables the RNG DMA engine.                      */
  __IOM uint32_t  RNG_DMA_ROSC_LEN;             /*!< This register defines which ring oscillator length configuration
                                                     should be used when using the RNG DMA engine.                             */
  __IOM uint32_t  RNG_DMA_SRAM_ADDR;            /*!< This register defines the start address in TRNG SRAM for the
                                                     TRNG data to be collected by the RNG DMA engine.                          */
  __IOM uint32_t  RNG_DMA_SAMPLES_NUM;          /*!< This register defines the number of 192-bits samples that the
                                                     RNG DMA engine collects per run.                                          */
  __IOM uint32_t  RNG_WATCHDOG_VAL;             /*!< This register defines the maximum number of CPU clock cycles
                                                     per TRNG collection of 192-bits samples. If the number
                                                     of cycles for a collection exceeds this threshold the WATCHDOG
                                                     interrupt is triggered.                                                   */
  __IM  uint32_t  RNG_DMA_BUSY;                 /*!< Status register for RNG DMA engine activity.                              */
} NRF_CC_RNG_Type;                              /*!< Size = 480 (0x1e0)                                                        */



/* =========================================================================================================================== */
/* ================                                       CC_RNG_SRAM_S                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief CRYPTOCELL RNG SRAM interface (CC_RNG_SRAM_S)
  */

